[
    {
        "title": "Business Information Security Officer",
        "description": "We are hiring for Business Information Security Officer who will be responsible for driving information security efforts within the business unit or functional area.",
        "company": "Google Singapore",
        "monthly_pay": 12000,
        "address": "38 Dakota Crescent",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Serve as a point of contact for BISOs. providing guidance and support to various BUs;Ability to prioritize and provide necessary support on the security tasks for designated BUs;Offer regular updates or flag outstanding important issues to relevant stakeholders;Standardize information security process across BUS/countries. driving the adoption of best practices;Bridge gap between local technology or business team with GIS. able to articulate security risks to local teams and contribute back any feedback to GIS;Drive the learning culture within the information security team to accelerate skills and knowledge of the information security community.",
        "desirable_skill_list": "Possess at least one of the following certification CISSP. CCSP. CRISC. or CISM;Understand Cloud Infrastructure.",
        "responsibility_list": "Support the overall governance of the security Key Risk Indicators (KRIS) for the designated and manage the risks to ensure alignment with the BUs' risk tolerance levels;Facilitate the investigation and management of security incidents for designated BUs and communicate to relevant stakeholders;Ensure clear documentation of the business justifications, risks, the existing mitigation controls (if any) and relevant approvals are in place;Support security assessment for technology solutions for designated BUs;Offer expertise  to BUs with the help of Group Information Security (GIS) Subject Matter Expert (SME);Collaborate with enterprise risk management to conduct risk assessments and support the development of risk treatment plans for the BUs;Facilitate the local implementation of group information security initiative for the designated BUs;Assist with the security awareness programs for designated BUs to enforce security culture and understand the information security solutions in BUs;Help to develop  the Business Information Security Officer (BISO) framework / handbook outlining BISOs roles and responsibility_list. This standardizes practice across the organization;Establish and maintain BISO community to share insights or discussion of findings from audits, incidents, or latest security trend with each BUs to facilitate cross-learning and capture lessons teamed;Gather input or recommendations with regards to Group Information Security (GIS) functions and programs from BISOs across various countries/markets. Compile the feedback and contribute to GIS for continuous improvement of the Security Operation Model;Collaborate with security teams to develop and implement tailored security awareness programs for business units and devise a structured professional development pathway for BISOs."
    },
    {
        "title": "Project Manager",
        "description": "Responsible for overseeing and coordinating various aspects of a project from initiation to completion, ensuring that it is completed on time, within budget, and according to specified quality standards. The Project Manager is the central point of contact for stakeholders and is responsible for planning, organizing, and managing resources effectively to achieve project objectives.",
        "company": "Shopee Singapore",
        "monthly_pay": 10000,
        "address": "100 Cecil Street",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's degree required, preferably in Computer Science or Information Systems;Professional qualification in project management is required (e.g. PMP, Prince2) and Agile (eg. Agile SAFe, Scrum master or Kanban);At least 8 years of experience in hands-on project management experience;At least 3 years in Agile experience;Experience working with regional and global teams;Extensive project management skills in planning, budgeting, tracking, status reporting, stakeholder management, etc;Understanding of various technology platforms across Desktop, Systems, Servers, Data Center, Storage;Banking/Insurance industry experience is preferred;Strong in manage complex projects and multiple projects at a time;Preferred working experience in Centre of Excellent model.",
        "desirable_skill_list": "Sound experience in large-scale office integration and relocation project preferred;Strong in the presentation skill;Proven record to manage troubled teams/projects and bring them to success;Strong leadership, communication and vendor management skills;Good supervisory skill, able to drive a project team composed of members from different departments;Excellent in problem solving skills;Excellent communication skill;Good stakeholder management;Collaborative and a good team player;",
        "responsibility_list": "Evaluate, respond and to Manage Project implementation in agile practice;Manage the project budget, cost management according to internal business management rules;Monitor and control execution of projects though Plan, Build and Run processes;Perform project reporting (e.g. performance, status) and deliver and socialize project completion documentations;Conduct project evaluations, and share the results with Service Owners and Group Infra Lead;Liaise and communicate with various global and regional stakeholders including Business, IT, Operations, etc;Identify potential project risks and define the right mitigation strategy;Work with senior management on communications, project updates, and escalation."
    },
    {
        "title": "Business Data Analyst",
        "description": "We are looking for an experienced Business Data  Analyst to be a part of Risk Management Team and to work for projects with a leading bank.",
        "company": "Grab Singapore",
        "monthly_pay": 8000,
        "address": "80 Anson Road",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "A Bachelor’s or Master’s degree in Business or Computer Science;At least 2-4 years of experience as a Business, System or Data Analyst within banking industry;Have a good understanding of data analysis and reconciliations;Must be proficient in the UAT process and overall UAT management of UAT;Very good proficiency in SQL queries/scripting and able to extract data from databases;Good Understanding of Stakeholder management and requirements gathering;Strong team player with good interpersonal skills.",
        "desirable_skill_list": "DataMart or Banking products experience and knowledge.",
        "responsibility_list": "Work within Risk Management team and work collaboratively in cross-functional teams to become an effective “bridge” between users and technology;Able to prepare proper documentation on the data flow, design, business solutioning and testing approach in accordance with predefined template;Should collate and rationalise all stakeholders’ requirements and walkthrough these requirements with team;Responsible to handle large volume of data for analysis, reconciliation and testing;Actively partner the team in the solutioning process to ensure that the business solutions are properly implemented in line with the user needs;Responsible for overall UAT management in terms of timelines, batch runs and managing the testing results;Responsible for understanding the scope of the project, the changes associated and support the Project Manager in impact assessment."
    },
    {
        "title": "Business Analyst",
        "description": "We are seeking a highly motivated and skilled Test lead with experience in stakeholder management, to work on projects with a leading bank.",
        "company": "Sea Limited",
        "monthly_pay": 9000,
        "address": "1 Harbourfront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Business Administration, Information Technology, or a related field;5+ years of experience as a Business Analyst/Test Lead, with a focus on requirement gathering and testing processes;Strong experience in writing user stories and documenting acceptance criteria;Familiarity with Agile methodologies and tools (e.g., JIRA, Confluence);Actively manage UAT progress and issues within project timelines, providing updates to the business team and key stakeholders;Maintain a JIRA dashboard for status updates;Assist the product owner and UAT lead in preparing the Test Strategy and Test Plan;Ensure traceability among test cases, user stories, and defects in JIRA during testing execution;Excellent communication and stakeholder management skills;Strong analytical and problem-solving abilities;Ability to work collaboratively in a fast-paced environment.",
        "desirable_skill_list": "Experience in the Banking and Financial Services sector;Knowledge of compliance requirements (KYC, AML);Certifications such as Certified Scrum Product Owner (CSPO) or Project Management Professional (PMP).",
        "responsibility_list": "Collaborate with product owners to create and refine user stories for system improvements;Engage in workshops and discussions to review Business Specification Documents (BSD);Define acceptance criteria for user stories and obtain approval from product owners;Support the product owner and UAT lead in formulating comprehensive Test Strategies and Test Plans;Identify potential challenges, risks, and gaps within the testing framework;Organize UAT kick-off meetings and maintain regular progress meetings to monitor updates;Evaluate test scenarios and cases with key product owners to ensure they align with business needs;Maintain a JIRA dashboard to provide status updates and ensure traceability between test cases, user stories, and defects;Oversee UAT progress and address issues within project timelines, providing updates to the business team and stakeholders;Coordinate with related teams to facilitate testing efforts and confirm environment readiness;Monitor and manage the UAT defect pool to ensure prompt resolution;Analyze and summarize outstanding defects as necessary, leading daily defect triage meetings for resolution;Generate daily reports to track UAT progress, summarizing key metrics and findings for stakeholders."
    },
    {
        "title": "Senior Java Engineer",
        "description": "Join our innovative team as a Backend Engineer where you'll design and develop robust, scalable applications for a major bank. This role emphasizes stability, performance, and security, with a focus on end-to-end ownership of your software products, including development, deployment, and ongoing support. You'll be instrumental in developing scalable solutions, supporting deployment automation, and implementing industry-standard security practices throughout the development lifecycle.",
        "company": "Singtel",
        "monthly_pay": 11000,
        "address": "1 Comcentre",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have 5+ years of experience in Java (version 8 or higher; Java 11+);Hands-on experience with Spring Framework, Spring Boot, and RESTful API development;Familiarity with code versioning tools, especially Git;Experience with test automation tools like JUnit and Mockito;Competency with database technologies, including SQL, JPA, and Hibernate;Familiarity with CI/CD platforms, particularly Azure DevOps;Knowledge of microservices architecture, containerization, and orchestration (e.g., Docker, Kubernetes);Familiarity with build tools like Maven;Strong English communication skills, both written and verbal;Experience working in an Agile environment, ideally following Scrum methodology.",
        "desirable_skill_list": "Proven experience in building backend solutions with RESTful APIs, databases, and messaging services using a modern tech stack;Strong background in software development with skills in OOP, functional programming, design patterns, concurrency, and Test-Driven Development (TDD);Experience with CI/CD pipelines, test automation, and Agile methodologies.",
        "responsibility_list": "Take ownership of the full software lifecycle—from development through support—ensuring reliability and top-tier performance;Develop secure, scalable deployment pipelines for continuous integration and delivery (CI/CD);Automate testing as part of the design, coding, build, and release processes;Implement observability and monitoring to ensure optimal performance and early detection of issues;Collaborate with cross-functional teams to define, design, and deliver new features;Incorporate security best practices at every stage of development;Mentor team members and support hiring efforts by participating in technical interviews;Stay current with emerging technologies, industry trends, and best practices to continuously improve team output."
    },
    {
        "title": "Backend Engineer",
        "description": "We’re seeking a skilled Backend Engineer to join our dynamic team and play a crucial role in building, optimizing, and maintaining backend applications for a global bank. In this role, you'll work on creating secure, high-performance, and scalable backend solutions, collaborating with cross-functional teams, and championing modern DevOps and Agile practices.",
        "company": "DBS Bank",
        "monthly_pay": 13000,
        "address": "12 Marina Bay Financial Centre",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have 5+ years of experience in building backend systems, implementing RESTful APIs, working with databases, and integrating with messaging services;Strong understanding of software fundamentals, including OOP, functional programming, concurrency, design patterns, and Test-Driven Development (TDD);Hands-on experience with CI/CD pipelines and automated testing frameworks, ensuring efficient and reliable code releases;Proven ability to work effectively within Agile teams, showing flexibility and teamwork skills in a diverse, multicultural environment;Deep understanding of secure coding practices and commitment to protecting applications and user data;Strong problem-solving skills with the ability to analyze complex technical issues and deliver practical, innovative solutions;Effective communication skills for explaining technical concepts clearly to both technical and non-technical team members;Adaptability and flexibility to thrive in a fast-paced environment and adjust to changing priorities or requirements.",
        "desirable_skill_list": "Knowledge of cloud platforms (e.g., AWS, Azure) and microservices architecture to build, deploy, and manage distributed applications;Excellent written and verbal communication skills to collaborate effectively across teams and present complex technical information in a clear manner.",
        "responsibility_list": "Build reliable and efficient backend solutions that meet high standards for security and performance;Write and implement automated tests to ensure software quality and reliability;Establish continuous integration and delivery (CI/CD) pipelines to streamline deployment and enhance efficiency;Embrace a culture of continuous improvement by applying DevOps and Agile principles throughout the development process;Partner with product managers, designers, and front-end engineers to define, design, and deliver impactful features;Integrate security best practices at every stage of the development lifecycle to maintain application integrity and protect user data;Contribute to the team’s development by mentoring peers, participating in technical interviews, and sharing industry insights;Continuously learn and explore the latest in technology, trends, and best practices to drive innovation and improvements."
    },
    {
        "title": "Lead Engineer",
        "description": "We’re looking for a skilled Lead Engineer to join our global team! As a Lead Engineer, you’ll collaborate closely with both IT and business stakeholders to design, implement, and refine solutions across multiple projects and teams. You’ll be hands-on with technical specifications, project coordination, and agile practices, guiding your team to success through each phase of the development lifecycle.",
        "company": "OCBC Bank",
        "monthly_pay": 10500,
        "address": "65 Chulia Street",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have Bachelor’s degree in Computer Science, Engineering, or related field from a reputable university;Have 5+ years of experience in software development with hands-on expertise in agile methodologies, particularly Scrum;Strong knowledge of IT architecture, particularly in microservices, REST & SOAP application services, and retail banking technology;Proven track record in Java development on the J2EE platform with experience in Spring and Spring Boot;Expertise in front-end frameworks like Angular and JavaScript libraries (TypeScript, jQuery);Strong experience with DBMS and SQL (Oracle, PL/SQL), Git, and CI/CD tools such as Azure DevOps;Comprehensive understanding of agile principles, TDD, and experience in automated testing frameworks (JUnit);Effective communication and presentation skills in English (C1 level or above), with the ability to interact across varying seniority levels and technical backgrounds;Demonstrated ability to lead, problem-solve creatively, and drive project progress.",
        "desirable_skill_list": "Strong analytical skills with the ability to develop and present end-to-end solutions;Familiarity with UML standards and architecture modeling;Experience in complex, 24/7 operational environments, with a focus on scalable, resilient applications.",
        "responsibility_list": "Lead the translation of complex business requirements into actionable technical specifications that deliver real business value;Develop end-to-end solutions, breaking down requirements and identifying optimal paths forward by analyzing costs, benefits, and risks;Collaborate with cross-functional squads to manage dependencies and deliver cohesive, scalable solutions;Interpret business rules and functional requirements to create technical specifications with an architectural focus on system interactions, data exchanges, and transformations;Act as a subject matter expert on microservices architecture, domain design, and REST/SOAP applications, ensuring robust, scalable solutions;Participate in the shaping, feasibility analysis, and development of Epics and User Stories in collaboration with developers, providing technical guidance where needed;Drive and participate in continuous improvement initiatives, supporting test development, test-driven practices, and problem determination."
    },
    {
        "title": "Manager-Digital Marketing",
        "description": "We are seeking an experienced and results-driven Digital Marketing Manager to join our team supporting our client in the Financial Services sector. The ideal candidate will lead the planning, execution, and optimization of the online marketing efforts. The primary goal is to grow the brand's influence while increasing brand loyalty and awareness. The Digital Marketing Manager will oversee various digital marketing channels, including SEO / SEM, email, social media, and display advertising campaigns.",
        "company": "UOB",
        "monthly_pay": 9500,
        "address": "80 Raffles Place",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s / Master's Degree, preferably in marketing or business management or related fieldAt least 8 years of experience as a content manager with experience in online community building;Experience in managing customer-facing platform with metrics that demonstrate improvements in both customer satisfaction and cost management;Strong understanding of project management and the documentation essential to all digital projects such as scope of work, project brief, functional specifications, user acceptance tests, timelines;Experience with A/B testing, conversion rate optimization (CRO), and user experience (UX) principles;Eye for detail and a creative and strategic thinker;Adaptable to changes and new technologies;Excellent communication, project management, and analytical skills;Build relationships and work effectively with numerous departments across the region;Takes initiative to improve current state of things and adaptable to embrace new changes.",
        "desirable_skill_list": "Proficiency in Adobe Experience Manager (AEM);Familiar with Adobe Enterprise Manager, or has done Website work and development.",
        "responsibility_list": "Develop and implement comprehensive digital marketing strategies to achieve business objectives, including lead generation, brand awareness, and customer acquisition;Plan and execute all digital marketing campaigns, including SEO/SEM, email marketing, social media, content marketing, and display advertising;Optimize content and website structure for search engines to improve organic search rankings;Manage paid search campaigns to maximize ROI;Monitor, analyze, and report on key performance indicators (KPIs) such as conversion rates, traffic, and campaign effectiveness;Work closely with cross-functional teams, including C- Level Stakeholders, sales, product, and creative teams, to align marketing strategies with business goals;Design content and stories to support the specific product features of the apps, marketing campaigns as per product messaging;Keep up-to-date with the latest digital marketing trends, tools, and best practices."
    },
    {
        "title": "Senior Backend Engineer",
        "description": "We are hiring Senior Backend Engineer for a global bank, you will be integral to a cross-functional team developing and maintaining applications that drive the bank’s digital journey. Reporting to a Squad Lead, you’ll collaborate on building high-performance solutions, leveraging the latest technologies, and embedding secure development practices in every phase. This role offers a unique blend of hands-on development, mentorship, and the opportunity to engage with global teams.",
        "company": "Standard Chartered Bank",
        "monthly_pay": 12500,
        "address": "6 Battery Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have 5+ years of proven experience in backend development, with expertise in building RESTful APIs and working with databases and messaging services;Solid understanding of software development principles: OOP, functional programming, design patterns, concurrency, and TDD;Proficiency in Java 8 or higher (Java 11+ preferred) and experience with Spring and Spring Boot;Familiarity with CI/CD practices and test automation tools like JUnit and Mockito;Knowledge of version control systems (preferably Git);Strong skills in RESTful API development and effective communication.",
        "desirable_skill_list": "Experience with database technologies (SQL, JPA, Hibernate);Working knowledge of microservices architecture, containerization, and orchestration;Familiarity with CI/CD platforms (preferably Azure DevOps) and build tools like Maven.",
        "responsibility_list": "Design, develop, and maintain high-performance backend applications that support critical banking functions and drive the digital transformation of finance;Champion best practices in automated testing, incorporating robust test coverage from development through deployment to ensure top-tier software reliability;Configure and refine continuous integration and delivery pipelines, making deployments seamless and setting new standards for speed and reliability;Foster a culture of collaboration, continuous improvement, and operational excellence through DevOps and Agile methodologies;Work closely with product managers, UX designers, and other engineers to build user-centered solutions that meet business needs and exceed user expectations;Embed security as a core principle in every stage of development, ensuring applications are resilient against emerging threats;Share knowledge, guide junior developers, and contribute to a culture of learning and innovation by participating in technical mentorship and interview processes."
    },
    {
        "title": "Cloud Network Engineer",
        "description": "We are seeking a talented Cloud Engineer to join our growing team, where you will play a pivotal role in designing, implementing, and managing cloud-based solutions. You will work with DevOps, SRE, and DevSecOps teams across the globe, contributing to the continuous improvement and innovation of Public Cloud domain.",
        "company": "Maybank",
        "monthly_pay": 8500,
        "address": "10 Anson Road",
        "remote": false,
        "job_type": "Internship",
        "mandatory_skill_list": "Have 4 years of experience in DevOps practices, automation, and CI/CD pipelines;Strong understanding of basic public cloud concepts and services;Proficient in Terraform for automating cloud infrastructure;Strong foundation in networking and cloud networking concepts;Basic understanding of cloud security and governance;Strong analytical and troubleshooting skills;Ability to work effectively in cross-cultural, global teams;Excellent written and verbal communication skills for working with global teams and stakeholders;Ability to work independently in a fast-paced environment, delivering high-quality solutions under pressure.",
        "desirable_skill_list": "Familiarity with implementing security policies in cloud environments;Strong drive to research and experiment with new technologies.",
        "responsibility_list": "Implement new features for applications and platforms, ensuring alignment with business requirements;Design and build CI/CD pipelines for smooth deployment of applications and platforms;Create and propose technical solutions that meet business objectives and requirements;Investigate, assess, and recommend technologies for implementation through Proof-of-Concepts (PoCs);Manage, maintain, update, and secure applications and platforms owned by the squad;Participate in on-call rotation to provide technical support for platforms and applications;Analyze and troubleshoot incidents, resolving issues efficiently;Work closely with Chapter Lead and Cloud Engineers to prioritize backlog and deliverables;Assist in documenting technical solutions and contribute to team standards and best practices;Contribute to the definition of technical standards, guiding the team toward innovative solutions;Investigate and prototype emerging technologies, recommending their adoption into operational environments."
    },
    {
        "title": "Senior Data Engineer",
        "description": "We are hiring Senior Data Engineer, you will play a critical role in ensuring the quality and stability of Credit Risk Reporting applications. You’ll work closely with cross-functional teams to develop, test, and optimize solutions that meet compliance, regulatory, and business requirements. Your expertise will drive improvements in software quality, data accuracy, and overall system performance in a complex data environment.",
        "company": "Citibank",
        "monthly_pay": 14000,
        "address": "3 Temasek Ave",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have 5+ years of experience in SQL, PL SQL and data warehousing;Have strong knowledge of various test methodologies, including BDD, TDD, and white-box testing, with hands-on experience in tools like Cucumber, Selenium, and Rest Assured;Advanced expertise in Oracle databases, including setup, PL/SQL packages, stored procedures, query writing, and query tuning;Proficiency in CI/CD with Azure DevOps, setting up new pipelines, and using Ansible for playbooks;Strong scripting abilities in Bash, Python, and Shell;Foundational knowledge of data warehousing and ETL processes, along with tools such as Azure Data Factory;Familiarity with Linux OS and experience working on cloud environments, preferably Azure.",
        "desirable_skill_list": "Familiarity with JMeter, Gatling, Postman, and SoapUI;Background in Credit Risk reporting, Banking, or Insurance.",
        "responsibility_list": "Engage actively in all development stages, from Business Analysis to test cycles, to ensure seamless delivery and quality assurance;Design, develop, and implement test strategies, plans, and cases, including functional, integration, and system testing;Enhance automated testing, improving test coverage, reducing manual effort, and ensuring high-quality code. Increase end-to-end test automation and coverage daily;Set up and maintain CI/CD pipelines and related DevOps practices using Azure DevOps, and automate test integration in the development process;Conduct data quality checks, data comparisons, and testing of data models, with a focus on PL/SQL, query tuning, and Oracle database environments;Improve stability, performance, and reliability of Credit Risk Reporting applications to comply with IT security standards;Work with developers, business analysts, and testers to optimize and streamline IT processes and the overall testing approach."
    },
    {
        "title": "Java DevOps Engineer",
        "description": "We are seeking a skilled and experienced DevOps Engineer to join our team at a leading global bank. In this role, you will play a crucial part in enhancing our infrastructure, automating processes, and ensuring seamless deployment of applications. If you have a passion for DevOps and are eager to work in a dynamic and collaborative environment, we want to hear from you.",
        "company": "HSBC",
        "monthly_pay": 11500,
        "address": "80 Collyer Quay",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Has at least 4+ years of experience in DevOps engineering;Proficiency in backend development using Java and Spring Boot;Proficiency in cloud platforms such as Azure, AWS, or Google Cloud;Hands-on experience with CI/CD tools such as Jenkins, GitLab CI, or Azure DevOps;Expertise in containerization technologies such as Docker and Kubernetes;Strong scripting skills in languages such as Python, Bash, or PowerShell;Experience with Infrastructure as Code (IaC) tools such as Terraform or CloudFormation;Proficiency in monitoring tools such as Prometheus, Grafana, or ELK Stack;Proficient in using Git for version control and collaboration.",
        "desirable_skill_list": "Experience with microservices architecture and deployment;Knowledge of configuration management tools such as Ansible, Puppet, or Chef;Understanding of networking concepts and protocols.",
        "responsibility_list": "Design, build, and maintain scalable and resilient infrastructure on cloud platforms;Implement and manage CI/CD pipelines to automate the deployment process;Set up comprehensive monitoring and logging systems to ensure high availability and performance of applications;Utilize configuration management tools to ensure consistency across environments;Implement security best practices to safeguard applications and infrastructure;Identify and resolve infrastructure-related issues, providing support for production environments;Continuously improve the infrastructure, deployment processes, and toolsets."
    },
    {
        "title": "IT Asset Manager",
        "description": "We are hiring for IT Asset Manager who will be overseeing the daily and strategic management of both hardware and software assets.",
        "company": "Bank of America",
        "monthly_pay": 13500,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in information technology, computer science, or business administration, or related field;Minimum 5+ years in IT Asset Management;Strong leadership skills with the ability to manage and supervise teams;Well-versed in IT software and hardware, with a focus on CMDB, ITSM tools, especially ServiceNow;Proven ability to successfully execute strategic asset management processes;Profound understanding of licensing agreements, particularly with Microsoft, IBM, and Oracle;Strong skills in vendor management and negotiation;In-depth knowledge of IT Service Management processes and experience with Discovery tools;",
        "desirable_skill_list": "Relevant certifications in IT asset management, project management, or related fields;",
        "responsibility_list": "Perform daily and long-term operational and strategic management of hardware and software;Plan, monitor, and record hardware assets and/or software licenses to ensure compliance with vendor contracts;Keep track of IT assets within the Configuration Management Database throughout their lifecycle;Provide KPI/Metric for regular/ad hoc reporting of IT assets;Design processes related to software and hardware asset management, execute, and enhance them;Establish and maintain documentation of procedures, processes, and reports concerning asset management;Collaborate with Procurement and Finance in asset tracking, PO reconciliation, and asset write-offs;Perform verification and audit of IT assets – verify software assets with license contracts, confirm hardware assets with actual inventory, and initiate corrective actions.Perform wall-to-wall asset tagging across data centers and office locations;Collaborate with IT units concerning assets compliance audits and take ownership of ITSM Asset Management Tool."
    },
    {
        "title": "Operations Analyst – Security",
        "description": "Responsible for monitoring, analysing, and responding to security threats and incidents within an organization's IT environment. This role involves ensuring the confidentiality, integrity, and availability of company systems and data by identifying and mitigating security risks and vulnerabilities.",
        "company": "Oversea-Chinese Banking Corporation Limited",
        "monthly_pay": 9000,
        "address": "1 Raffles Place",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Minimum 3 years working experience in security operations, preferably in Financial Institutions;Degree from Information Technology or equivalent discipline;Excellent interpersonal and influential skills to enable the implementation and enforcement of security operations;Good communication and presentation skills;Sound knowledge on applications, systems and networking technologies with an understanding on their implications on data security;Good understanding on latest cyber security trends.",
        "desirable_skill_list": "Excellent interpersonal and influential skills to enable the implementation and enforcement of security operations;Certification on CISSP / CEH / CISA / CISM is preferred;Regional experience in this role is an added advantage.",
        "responsibility_list": "Operate security infrastructure on network & Cloud Security. Knowledge in  F5 WAF, Firewall ,IPS & Cloud Security support, reporting and management of monthly metrics;Produce and maintain Standard Operating Procedures on network security operations;Delivery of IT security services to country business units according to the agreed scope and service levels;Processes and procedures are documented so that security operations can be audited;Continuously monitor security tools (SIEM, firewalls, intrusion detection/prevention systems) to detect and respond to potential security incidents;Stay updated on emerging security threats and trends.Proactively identify and mitigate potential risks."
    },
    {
        "title": "Data Engineer",
        "description": "A great opportunity as a Data Engineer to work in cloud based data engineering, analytics and data management team in a well established company.",
        "company": "United Overseas Bank Limited",
        "monthly_pay": 10000,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's Degree in Computer Science or equivalent;Minimum 5 years of experience in data engineering and data management;Hands on technical experience in Azure Data Factory, Databricks, Synapse, SQL Server Integration Services;Strong experience in Python / SAS / R along with Tableau / Power BI;Strong experience in gathering business requirements and translating into technical specification;Strong analytical skills with high curiosity to deep dive into root cause of problems and suggest solutions;Has good stakeholders management experience;Attention to technical details;Ability to deliver tasks on time with high quality outcome;Self motivated and ability to take ownership;Strong written and spoken communication skills.",
        "desirable_skill_list": "Azure Data Engineer Certified;ITIL certified;Prior experience in Python, R or Machine Learning tools.",
        "responsibility_list": "Design and develop data models, ETL pipelines, data integration process while ensuring data accuracy and quality;Perform data analysis of structured and unstructured data and perform business intelligence initiatives such as build user friendly reports using data visualization tools;Analyze ETL requirements from users and provide solutions accordingly;Responsible for planning and executing data profiling and data quality analysis;Monitor data pipelines, databases and analytical processes to ensure smooth operations;Identify and resolve data-related issues, performance bottleneck and data quality problems;Design and document data catalogs and data architectures;Perform regular data cleansing exercise to ensure that data is of high quality and relevant to the business needs;Execute data transformation, correction and aggregations to ensure compliance with business / regulatory requests;Build and maintain reports and dashboards using suitable data visualization tools;Conduct analysis on the reports and translate the findings into valuable insights to business users;Prepare data for prescriptive and predictive modelling;Perform database monitoring and performance tuning."
    },
    {
        "title": "Business Analyst",
        "description": "We are seeking a Business Analyst with a strong interest in business processes and process re-engineering.You will be part of the IT Application team supporting the In-house application.",
        "company": "Development Bank of Singapore",
        "monthly_pay": 7500,
        "address": "50 Raffles Place",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree or Diploma in Software Engineering, Computer Engineering or similar fields;At least 3-7 years of experience in delivering and supporting IT applications as a Business Analyst;Strong experience in requirements gathering, gap analysis, and documentation;Demonstrates exceptional ability to comprehend business processes and implement process re-engineering to address business needs and challenges;Good working experience in SQL, JIRA, and Confluence;Strong negotiation, and stakeholder management skills;Strong communication, presentation, and documentation skills;Capable of working independently, managing stress effectively, and multitasking in a fast-paced environment.",
        "desirable_skill_list": "Familiarity with a particular industry (such as finance, healthcare, or retail) can be an advantage;Certifications like SCRUM Master or Product Owner are advantageous.",
        "responsibility_list": "Responsible for working with business users/product owners to gather business requirements;Translate business needs to ensure that developers and business users have a common consent;Articulate business requirements and translate them into functional and technical specifications;Facilitate the tracking and reporting of project progress, issues, and risks to ensure timely delivery of project milestones;Proficient in concurrently supporting multiple application systems and platforms;Adhere to the organization and project standards & guidelines."
    },
    {
        "title": "Java DevOps Developer",
        "description": "",
        "company": "Singapore Post",
        "monthly_pay": 6500,
        "address": "10 Eunos Rd 8",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Computer Engineering, Information Technology & Engineering;Minimum of 5 years of hands-on experience in software development using Java technologies;Experience in system design (include database design), development, quality assurance and maintenance of web based Java enterprise systems;Proficiency in Java Enterprise Edition or Spring (Batch, Boot, Web) and Microservices;Proficiency in Development of Web-based applications using UI framework such as Angular/AngularJS, JQuery, Struts;Proficiency in Development of application using Persistence framework such as Hibernate, JPA;Proficiency in Relational Databases like DB2, SQL Server, Oracle;Working experience in using Webserver like Apache Webserver, Microsoft IIS;Hands-on experience with CI/CD tools such as Jenkins, GitLab CI, or AWS DevOps;Working experience in Apache JMeter;Strong scripting skills in languages such as Python;Good understanding in Object Oriented Analysis and Design;Excellent verbal and written communication skills;Team player with excellent interpersonal and communication skills, capable of both independent work and effective collaboration.",
        "desirable_skill_list": "Familiar in containerization technologies such as Docker and Kubernetes.",
        "responsibility_list": "Part of the software team – involve in requirements analysis, contribute to system design and oversee the development, testing, and deployment of applications;Address performance and security requirements in applications, resolving any related issues;Collaborate effectively with other engineers to integrate software components, system infrastructure, and third-party components;Design and develop APIs within a microservices-based architecture;Work closely with business users and application testers to identify and rectify defects;Monitor application performance, troubleshoot issues, and ensure seamless operation;Involve in Regression Testing and User Acceptance Testing;Assist in the deployment via CI/CD pipeline and code repository using GitLab;Troubleshoot deployment issues, conduct root cause analysis, and implement corrective measures to optimize deployment workflows."
    },
    {
        "title": "Incident Manager",
        "description": "We are looking for a seasoned Incident manager who will be overseeing the incident management process within an organization to ensure that incidents are promptly addressed and resolved.",
        "company": "SMRT",
        "monthly_pay": 7000,
        "address": "10 Sin Ming Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's degree in computer science, information technology, or related field;Atleast 5 years of experience in Incident Management;Capable of dissecting complex issues and identifying effective solutions;Demonstrated experience in IT incident management or a similar role, preferably within a fast-paced IT environment;Must have comprehensive knowledge of ITIL incident management principles and best practices;Proficient in using incident management tools and systems;Proficiency in project management, documentation, and task prioritization;Identify and understand the needs of stakeholders—individuals or groups invested in the outcome of an incident;Must have outstanding communication skills, capable of conveying technical information effectively to both technical and non-technical audiences;Able to excel under pressure and effectively prioritize tasks in a high-pressure IT environment.",
        "desirable_skill_list": "Experience in a regulated industry;ITIL 4 certification;Experience with ServiceNow is advantageous.",
        "responsibility_list": "Lead root cause analysis sessions to identify fundamental issues and preventive measures;Track follow-up actions to ensure timely resolution of problem tickets;Analyze and log problem tickets for future reference;Serve as the gatekeeper for all known errors;Monitor and report on Problem Management KPIs;Coordinate efforts across L2 and L3 support teams for timely incident resolution;Escalate cases involving process failures that delay resolution or result in SLA breaches;Attend regular incident review meetings to ensure open incidents are addressed promptly;Generate periodic service reports for stakeholders;Analyze incident trends to identify opportunities for improvement;Ensure incidents are documented accurately according to the Incident Management process;Conduct reviews of major incidents to capture insights and finalize improvement actions."
    },
    {
        "title": "Information Security Technical Program Manager",
        "description": "We are seeking a highly experienced Information Security Technical Program Manager to lead our ISO 27001:2022 certification initiative. The successful candidate will manage all aspects of the certification process, ensuring alignment with organizational objectives and industry standards.",
        "company": "ComfortDelGro",
        "monthly_pay": 8000,
        "address": "25 Ubi Ave 1",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "5+ years of experience in Project Management, with 3+ years directly managing ISO 27001 certification or similar standards;Strong knowledge of ISO 27001:2022 standards and requirements;Experience in developing and maintaining comprehensive project plans, including timelines and milestones;Experience in managing ISO 27001-related risks and conducting internal/external audits;Excellent communication and leadership skills with the ability to engage with cross-functional teams (Technology, Compliance, Legal, HR, Operations) and external auditors;",
        "desirable_skill_list": "ISO 27001 Lead Implementer or Lead Auditor certification is highly preferred;PMP, CISSP, CISM, or similar certifications are a plus;",
        "responsibility_list": "Lead the ISO 27001:2022 certification program from start to finish, developing project plans and tracking milestones to ensure alignment with organizational goals;Oversee the creation, implementation, and maintenance of policies, procedures, and documentation for ISO 27001 compliance;Collaborate with Technology, Compliance, Legal, HR, and other teams, acting as the primary contact for external auditors;Identify and mitigate risks to ensure compliance with ISO 27001 standards;Drive initiatives to enhance the organization’s security posture and stay updated on ISO 27001 changes;Develop training programs to increase ISO 27001 awareness across the organization;Provide regular updates on certification progress, risks, and the organization’s security posture."
    },
    {
        "title": "Customer Solutions Manager",
        "description": "We are looking for a self-starter individual who will join our client as a Customer Solutions Manager to grow the innovative trusted and secured data exchange highway technology in Singapore.",
        "company": "SP Group",
        "monthly_pay": 9000,
        "address": "25 Kaki Bukit Rd 1",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology, Business, Engineering;At least 5 years of experience in business development, account management, partner management or presales experience in Technology;At least 3 years in customer facing role to resolve business problems through technology solutions;Strategic thinking, ability to forge strong relationships with key industry stakeholders / value chain partners;Experience in new market development, managing industry, venture capitalists, and go to market strategies in new technology deployment;Strong multitasking abilities, quick adaptability to develop executable plans in bringing projects from conception to launch, driving implementation to success;Good understanding in forefront technologies like Artificial Intelligence, Robotics, Data Analytics, Cybersecurity, IoT;Excellent presentation, communication, interpersonal and negotiation skills;Self-driven, resourceful and result oriented.",
        "desirable_skill_list": "Experience in business consulting;Data warehousing and / or data solutioning experience.",
        "responsibility_list": "Responsible to take end-to-end ownership of a diverse range of projects and initiatives driving development and implementation of mid to long term strategy to drive organization growth and adoption;Develop new business opportunities by evaluating projects and technologies, potential markets, business partners and industry players;To understand customer's business objectives and challenges and be their trusted partner to expand and assess the maturity, viability and suitability of different technologies and their applicability to resolve industry problems;Involve with internal and external stakeholders to fulfill program objectives with right needs resulting in the growth of the accredited companies;As the bridge between customer and organization to develop executable plans in bringing projects from conception to launch, driving implementation to success;Closely collaborate with cross-functional team to align with high standard complete evaluation process;Access and mitigate risks for all potential program and company during evaluation;Assist in planning and reporting activities to senior management."
    },
    {
        "title": "Network Engineer",
        "description": "Our prestigious client is seeking for a Network Engineer(s) to enhance and maintain the network performance service level to ensure the smooth business operations within the organization. You will be responsible to handle the incident response & investigation, working with vendors and the respective teams to efficiently resolve issues within the agreed Service Level Agreement (SLA).",
        "company": "Keppel Corporation",
        "monthly_pay": 11000,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Engineering, Electronics or Information Technology;At least 7 years of working experience in managing IT system network operations and support (24×7), service recovery, problem management, risk mitigation and impact assessment;Proven track record with over 7 years of hands-on experience in successfully implementing IT infrastructure projects for LAN and WAN environments;Proficient in installing and configuring a wide range of network technologies, including LAN, WAN,VoiP, WiFi, wireless controllers, access points, firewalls, security gateways, VPNs, 802.1x protocol, VLANs, and L2/3 switches;Skilled in using monitoring, network diagnostic, and network analytics tools to ensure optimal network performance and troubleshoot issues efficiently;Experience in project and vendor management;Excellent communication and interpersonal skills, with the ability to explain technical concepts to non-technical users;Strong problem-solving skills and the ability to work independently and collaboratively in a team environment.",
        "desirable_skill_list": "Professional and technical certifications that include CCIE, CCNA, CCDP, CCNP, ITIL, PMP, CITPM, CISSP, AWS Certified Solutions Architect.",
        "responsibility_list": "Lead and manage the network operations, incident handling, maintenance, compliance, and renewal of IT infrastructure systems (Wired/Wireless) to ensure all systems are working in good condition to maintain normal operations;Ensure proper project and change management to ensure delivered solutions meet technical, functional, performance and business requirements;Coordinate with vendors and act as a point of contact for mitigation measures and assist to resolve the issues and investigation for root cause;Collaborate with the IT teams to address vulnerabilities and respond to security incidents;Responsible to detect signs of abnormality and to report overall system health status to ensure recovery actions, correction actions and preventive measures are in place for every incident reported;Lead and manage 24/7 operations and conduct periodic audits to ensure that the network infrastructure complies with industry standards, regulations, and company policies;Maximizing network performance through ongoing monitoring and troubleshooting;Scheduling and coordinating network upgrades while investigating network faults;Provide regular reports to senior management on network performance, incident resolution, and compliance status."
    },
    {
        "title": "Business Analyst",
        "description": "We are looking for a Business Analyst to work on Asset and Liability Management (ALM) Digital projects for a leading bank..",
        "company": "Sembcorp Industries",
        "monthly_pay": 9500,
        "address": "71 Ayer Rajah Cres",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree in Banking, Financial Engineering, Computer Science or related discipline;Has 3+ years of relevant experience in the business analysis;Understanding and experience in the area of ALM Risk, including Liquidity Risk and Interest Rate Risk;Proficiency in SQL and Excel;Prior business analysis experience in interfacing between IT Teams and end Users;Translate business requirements into documents that can be used by IT Teams for the development of systems solutions;Strong interpersonal, communication, presentation, analytical, and problem-solving skills.",
        "desirable_skill_list": "Knowledge of LCR, NSFR, MCO and IRRBB;Prior experience in implementing or managing an ALM Risk System;Knowledge of machine learning and AI usage.",
        "responsibility_list": "Gather, collate, and analyze requirements from business users and provide clear functional specifications for enhancements to ALM Risk Systems;Perform impact analysis of enhancement requests on existing processes;Design solutions that are sound, adequate, and forward-looking to address ALM business requirements;Plan, schedule, and execute deliverable objectives from initiation till successful implementation within agreed timelines;Devise comprehensive test plans (including test scenarios and test cases) to test IT deliverables;Perform User Acceptance Testing, Regression Testing, Simulation Testing, and Live verification to ensure system deliveries meet requirements and objectives;Formulate a Roadmap for ALM Risk Systems that continually addresses existing and potential business needs;Provide functional support to business users and co-manage ALM Risk System production issues with technology partners."
    },
    {
        "title": "System Administrator",
        "description": "We are seeking a highly motivated and Infrastructure Engineer with expertise in Linux and Windows operating systems and work for projects with a leading bank.",
        "company": "CapitaLand Investment",
        "monthly_pay": 10500,
        "address": "8 Marina View",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma or Degree in Computer Science, Information Technology, or Engineering;2+ years of experience in IT Infrastructure environment;Exposure in handling incident, change management process;Experience of working on Linux, Windows and VMware server;Experience as a System administrator, provide support ,troubleshoot and maintain computer servers and networks;Able to work on 24/7 support require to handle BAU Operation;Available to resolve urgent environment problems outside of business hours;Excellent communication and collaboration skills;Great organizational, time management, and problem-solving skills.",
        "desirable_skill_list": "Work experience in Banking Industry.",
        "responsibility_list": "Involved in installing, configuring, and maintaining servers in a Linux, Windows environment;Closely monitor the health of the Linux, Windows, AIX, VMware servers through both automated and manual processes;Responsible for performing server hardware maintenance and upgrades;Prompt in taking timely action to resolve or escalate to the next level for investigation;Create and maintain documentation for procedures, configurations, and programs;Provide technical support and guidance to end users, addressing inquiries, resolving problems, and offering training as needed."
    },
    {
        "title": "Business Analyst",
        "description": "An exciting opportunity for a Business Analyst to work on credit card and card rewards processing in a fast-pace environment.",
        "company": "City Developments Limited",
        "monthly_pay": 8500,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Business,  Finance or equivalent.Has understanding in Credit Card and Card Rewards processing;Good experience in using Microsoft Excel;Meticulous and detail-oriented, capable of supporting user requests and testing;Possess good stakeholder management skills to work with different department;Strong planning skills with a commitment to meeting deadlines;Excellent communication skills to interact with teams efficiently.",
        "desirable_skill_list": "Work experience in banking industry.",
        "responsibility_list": "Coordinate with technology partners on solution design, delivery timeline, and readiness of the User Acceptance Testing (UAT) environment;Develop UAT plans, define test scope, scripts, and data; configure Rewards Campaigns in UAT, and conduct end-to-end testing;Record test outcomes and compile structured test documentation for stakeholder review and walkthroughs;Oversee UAT progress, provide timely updates, flag issues early, monitor resolutions, and keep business teams and key stakeholders informed;Work closely with technology, business, and operations teams on system implementation, including preparing instruction/parameter forms for Rewards Campaign setup;Organize live verification with business teams and stakeholders."
    },
    {
        "title": "Product Manager",
        "description": "We are looking for an experienced Product Manager to work for projects with a leading bank, you will play a key role in driving the design, development, and execution of innovative banking products that meet market demands and improve customer experience. The ideal candidate will have a deep understanding of the financial industry, a passion for product development, and the ability to lead cross-functional teams to deliver results.",
        "company": "Mapletree Investments",
        "monthly_pay": 12000,
        "address": "8 Marina Blvd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Minimum of 2+ years of experience in product management;Demonstrated ability to plan and execute successful marketing campaigns, particularly in customer acquisition and product utilization.;Strong data analytics experience with a proven ability to derive insights from data and improve product performance.;Experience in leading UAT, defining exit criteria, and managing test strategies;Ability to work closely with cross-functional teams, including Relationship Managers, Marketing, and Transaction Services, to meet business goals;Experience in leveraging digital channels for client acquisition and engagement;Ability to develop and execute new product propositions that meet the evolving needs of the market;Excellent written and verbal communication skills, with experience in presenting and training internal teams;",
        "desirable_skill_list": "Experience with product management tools such as Jira, Confluence, or Trello;Familiarity with regulatory requirements and compliance in the banking industry;Understanding of customer experience design and optimization;",
        "responsibility_list": "Define product vision, strategy, and roadmap in collaboration with stakeholders, including customers, business teams, and technology partners;Conduct market research and competitor analysis to identify opportunities and create differentiated products;Develop and manage product backlog, ensuring prioritization based on business goals, customer feedback, and market trends;Collaborate with cross-functional teams (engineering, UX/UI, marketing, legal, etc.) to ensure smooth product delivery;Track and analyze product performance, making data-driven decisions to improve product features, user experience, and profitability;Lead user acceptance testing (UAT), creating and implementing a robust test strategy, ensuring products meet agreed exit criteria and perform as expected;Provide UAT signoff and ensure seamless integration across teams for product rollouts;Create and maintain product documentation, release plans, and reports;Build relationships with internal and external stakeholders to ensure alignment and successful product outcomes;"
    },
    {
        "title": "Manual Tester",
        "description": "Seeking skilled Manual Tester with proven expertise in Quality Assurance and Application Testing.",
        "company": "Ascendas-Singbridge",
        "monthly_pay": 11500,
        "address": "80 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science or Engineering or Information Systems;Proven experience of atleast 2-4 years in manual testing, ideally within an application development;Proficient in test management tools like JIRA, TestRail, and similar platforms;Support UAT by setting up test environments and assisting end-users throughout the testing process;Solid understanding of SDLC and testing methodologies;Strong analytical and problem-solving skills to assess software functionality;Meticulous attention to detail for identifying even minor defects;Effective verbal and written communication for seamless collaboration with team members and stakeholders.",
        "desirable_skill_list": "Background in specific sectors (such as finance, healthcare, or retail);SQL and scripting knowledge.",
        "responsibility_list": "Design and execute comprehensive test plans and test cases based on requirements and specifications;Conduct manual testing on software applications to identify defects and ensure adherence to quality standards;Document, track, and report defects using test management tools, working closely with the development team to resolve issues;Create and maintain detailed test documentation, including test cases, scripts, and reports;Collaborate with developers, business analysts, and stakeholders to fully understand requirements and ensure thorough testing coverage;Perform regression testing to confirm that new code changes do not impact existing functionalities;Support User Acceptance Testing (UAT) by preparing test environments and assisting end-users during testing phases;Participate in process improvement initiatives to enhance the overall efficiency and effectiveness of testing activities."
    },
    {
        "title": "Full Stack Engineer",
        "description": "We are seeking a talented and driven Full Stack Engineer to join our team for a prestigious banking client. In this role, you will work with cutting-edge technologies to design and develop secure, high-performance applications that power banking services.",
        "company": "Temasek Holdings",
        "monthly_pay": 13000,
        "address": "1 Marina Blvd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Computer Science, Information Technology, or a related field;Have 4+ years of proven experience in back-end development using Java, with a deep understanding of Java frameworks and best practices;Strong proficiency in building microservices and RESTful APIs using Spring Boot, with a focus on performance and scalability;Solid experience in front-end development using React.js, with a strong understanding of state management, component design, and responsive layouts;Proficient in working with relational databases (e.g., MySQL, PostgreSQL) and writing efficient SQL queries;Experience with Git for code versioning and collaboration;Familiarity with Agile/Scrum development processes.",
        "desirable_skill_list": "Experience with cloud environments like AWS, Azure, or Google Cloud Platform;Knowledge of CI/CD pipelines, Docker, Kubernetes, and automated testing frameworks;Exposure to banking/financial services is a plus, especially in projects requiring strict regulatory compliance.",
        "responsibility_list": "Build and support full-stack applications, focusing on reliability, scalability, and performance using Java, Spring Boot, and React.js;Work closely with product managers, business analysts, and other engineers to understand and refine user requirements;Write clean, efficient, and well-documented code; contribute to code reviews and mentor junior developers;Ensure that solutions comply with banking standards, including secure coding practices, data protection, and regulatory guidelines;Integrate applications with other systems within the banking ecosystem, ensuring smooth data flows and efficient processing;Address production issues and performance bottlenecks, applying a proactive approach to problem resolution."
    },
    {
        "title": "Backend Engineer",
        "description": "We are hiring a talented and motivated Backend Engineer with expertise in Java and Spring Boot to join our team at a prestigious global bank. In this role, you will design, develop, and maintain high-performance backend systems that support our critical financial applications.",
        "company": "GIC",
        "monthly_pay": 12500,
        "address": "79 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "At least 5+ years of experience in backend development with a focus on Java and Spring Boot;Strong proficiency in Java programming with a deep understanding of object-oriented principles;Extensive experience with Spring Boot and its various components, such as Spring MVC, Spring Data, and Spring Security;Solid understanding of RESTful API design principles and experience in developing and consuming APIs;Experience with relational databases (e.g., MySQL, PostgreSQL) and familiarity with ORM frameworks like Hibernate;Proficient in using Git for version control and collaboration;Experience with unit testing frameworks (e.g., JUnit) and a good understanding of test-driven development (TDD) principles.",
        "desirable_skill_list": "Experience with microservices architecture and related technologies (e.g., Docker, Kubernetes);Familiarity with cloud platforms (e.g., AWS, Azure, Google Cloud) and deploying applications in cloud environments;Understanding of DevOps practices and tools (e.g., CI/CD pipelines, Jenkins).",
        "responsibility_list": "Design, develop, and maintain robust backend systems using Java and Spring Boot;Develop and maintain RESTful APIs, ensuring seamless integration with frontend applications and third-party services;Design and optimize database schemas, write efficient queries, and ensure data integrity and performance;Write clean, maintainable, and testable code, following best practices and coding standards;Work closely with frontend developers, product managers, and other stakeholders to deliver high-quality software solutions;Identify and resolve performance bottlenecks to ensure the scalability and reliability of backend systems;Stay updated with the latest industry trends and technologies, continuously improving the development process and codebase."
    },
    {
        "title": "SAP Ariba Support Specialist",
        "description": "We are seeking an experienced SAP Ariba Support Specialist to test, train and support the end-users based on the company's procurement process. This role is crucial in ensuring a smooth adoption and optimal usage of the SAP Ariba platform, helping users effectively navigate and utilize the software.",
        "company": "PSA International",
        "monthly_pay": 9000,
        "address": "10 Pasir Panjang Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Proven experience with SAP ARIBA, including a strong understanding of procurement processes.Candidate has implemented and deployed at least 2 global/regional SAP ARIBA projects.Experience in delivering user training, providing ongoing support, and facilitating User Acceptance Testing (UAT) to ensure smooth transitions and user adoption.Excellent communication and interpersonal skills, with the ability to convey complex concepts clearly.Problem-solving skills and a proactive approach to resolving user issues, ensuring seamless system performance and end-user satisfaction.Ability to work effectively both independently and as part of a collaborative team, thriving in a fast-paced, dynamic environment.",
        "desirable_skill_list": "Familiarity with other procurement tools and systems.Experience in change management and user adoption strategies.Certification in SAP Ariba or relevant procurement methodologies is a plus.",
        "responsibility_list": "Work closely with project teams to develop and execute User Acceptance Testing (UAT) plans;Identify, document, and communicate any issues or necessary enhancements during the testing phases, ensuring timely resolution;Assist in refining processes based on user feedback to ensure the effectiveness and efficiency of the SAP Ariba system;Create tailored training materials and user guides for different user roles, ensuring content is relevant and accessible;Lead in-person or virtual training sessions for end-users, ensuring proper comprehension and practical application of the system;Offer ongoing support during training sessions, answering questions, addressing concerns, and clarifying doubts to ensure user confidence;Provide day-to-day support for users post-implementation, troubleshooting any issues that arise and ensuring system stability;Track user adoption and offer additional coaching or training where necessary to improve system usage and user proficiency;Gather and analyze user feedback to identify opportunities for continuous improvement of Ariba processes and tools;Collaborate closely with IT, procurement, and finance teams to ensure alignment on system usage and best practices across departments;Act as a liaison between users and the project team, facilitating communication to address concerns, updates, and any necessary changes promptly;"
    },
    {
        "title": "Chapter Lead – IT Audit",
        "description": "As the IT Risk and Compliance Team Lead, you will guide and empower a team focused on testing and validating IT General Controls (ITGC). Your role will drive team excellence in executing IT control testing, fostering a collaborative environment to meet international compliance standards, and ensuring continuous improvement in all processes.",
        "company": "Singapore Airlines",
        "monthly_pay": 10000,
        "address": "800 Airport Blvd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Information Technology, Computer Science, Risk Management, or a related discipline;Has 6 years of experience in IT risk management, IT General Controls (ITGC) testing, or compliance, with a demonstrated track record in team leadership;Excellent communication skills for cross-functional engagement and stakeholder management;Proven experience managing complex projects, with a focus on continuous improvement and change management;Deep expertise in SOX compliance, risk assessment, IT controls, and related frameworks;Strong problem-solving skills with a demonstrated ability to analyze complex control processes and develop risk mitigation strategies;Proficient in collaborating with diverse stakeholders across various functions and regions to meet risk and compliance objectives;Experience leading agile teams and managing concurrent projects in a dynamic environment.",
        "desirable_skill_list": "Background in Agile or Scrum to foster an adaptable and responsive team environment;Preferably  CISA, CRISC, or other relevant certifications in IT risk management or auditing",
        "responsibility_list": "Oversee a team responsible for planning, executing, and validating ITGC assessments to ensure compliance with SOX and other regulatory frameworks;Implement continuous improvements in control testing and workflows to enhance team efficiency, accuracy, and quality of results;Engage regularly with stakeholders to provide clear updates on risk assessment findings, remediation activities, and compliance status;Align team activities with the organization’s risk management strategies, ensuring alignment with broader business objectives;Ensure that all ITGC testing processes and outcomes are accurately documented, regularly reviewed, and reported to senior management;Provide guidance and development opportunities for team members, fostering a culture of growth, collaboration, and accountability."
    },
    {
        "title": "Outsystems Engineer",
        "description": "4 November 2024 We are looking for Out systems developer who are responsible for designing, developing, testing, and deploying web and mobile applications using the Out Systems low-code platform.Mandatory Skill(s)",
        "company": "Changi Airport Group",
        "monthly_pay": 8000,
        "address": "65 Airport Blvd",
        "remote": false,
        "job_type": "Internship",
        "mandatory_skill_list": "",
        "desirable_skill_list": "",
        "responsibility_list": ""
    },
    {
        "title": "C# Developer",
        "description": "4 November 2024 We are seeking a passionate and experienced C# Developer who thrives in dynamic environments and is eager to make a meaningful impact.Mandatory Skill(s)",
        "company": "Singapore Technologies Engineering",
        "monthly_pay": 9500,
        "address": "200 Pandan Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "",
        "desirable_skill_list": "",
        "responsibility_list": ""
    },
    {
        "title": "Application Support",
        "description": "An exciting opportunity for Application Support, responsible for providing expert-level support for business applications, with a specific focus on Linux/Unix environments and SQL databases.This role involves troubleshooting complex issues, scripting automation, and performing database management tasks to ensure application stability and performance.",
        "company": "Keppel Land",
        "monthly_pay": 11000,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "",
        "desirable_skill_list": "",
        "responsibility_list": ""
    },
    {
        "title": "C# Tech Lead",
        "description": "We are seeking a passionate and experienced C# Tech Lead who excels in dynamic environments and is driven to make a significant impact.",
        "company": "Fraser Centrepoint",
        "monthly_pay": 9000,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Engineering, and/or Computer Science;Minimum 5+ years of professional experience in C# .NET Development;Proficiency in WPF and ASP.NET for presentation frameworks;Strong understanding of relational database concepts; hands-on experience with MS SQL;Has strong leadership abilities and interpersonal skills;Proficient in Git with solid grasp of Git workflows;Experience in Agile Scrum teams; familiarity with Jira and Confluence;Good communication and presentation skills;Solid project organizational skills including attention to detail and multi-tasking skill.",
        "desirable_skill_list": "Experience working with Jenkins and Octopus;Certified .NET Developer;",
        "responsibility_list": "Being involved in software development, maintenance, and support of custom-built software applications;Provide leadership through coaching, mentoring, and creating opportunities for team members' professional growth;Prepare detailed technical documentation using Jira and Confluence to ensure effective communication;Conduct unit testing on software deliverables and assist in product, integration, and user acceptance testing;Provide post-implementation support, investigating and troubleshooting issues to ensure uninterrupted operation;Any other ad-hoc responsibility_list assigned."
    },
    {
        "title": "Application Support Analyst – eFX",
        "description": "30 October 2024",
        "company": "Frasers Property",
        "monthly_pay": 10000,
        "address": "1 HarbourFront Ave",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "ITIL Certified;Knowledge / experience with KDB+ time series database and analytics.",
        "desirable_skill_list": "",
        "responsibility_list": ""
    },
    {
        "title": "Application Developer",
        "description": "We are looking for a highly skilled and experienced Application Developer to be a part of Global Financial Markets (GFM) team and work as quant developer.",
        "company": "OUE Limited",
        "monthly_pay": 11000,
        "address": "50 Collyer Quay",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's degree in computer science, Engineering, or a related field ;Strong development experience with Murex, Flex, and C++;Proficient understanding of relational databases is required;Strong communication and analytical abilities;Highly motivated and dependable, with a commitment to delivering quality work.",
        "desirable_skill_list": "Experience with source control, continuous integration, and profiling tools;Familiarity with financial engineering concepts.",
        "responsibility_list": "Design and develop new derivative products utilizing Murex Flex technologies within the Murex platform;Optimize the performance of quantitative models and systems to enhance efficiency and reliability;Investigate and resolve defects in System Integration Testing (SIT), User Acceptance Testing (UAT), and production environments;Lead the end-to-end software development life cycle, ensuring quality and timely delivery of products;Work directly on the trading floor, collaborating with traders and quantitative modelers to align product development with business needs;Collaborate closely with the bank’s IT engineering teams to ensure seamless integration and deployment of solutions;Work closely with the bank’s IT engineering teams to facilitate integration and implementation of solutions;Engage with traders and quantitative modelers directly on the trading floor to ensure alignment of product development with market needs."
    },
    {
        "title": "Network Engineer",
        "description": "Our client is seeking a Network Engineer(s) to enhance and maintain the network performance service level to ensure the smooth business operations within the organization. You will be responsible to handle the incident response & investigation, working with vendors and the respective teams to efficiently resolve issues within the agreed Service Level Agreement (SLA).",
        "company": "Marina Bay Sands",
        "monthly_pay": 12000,
        "address": "10 Bayfront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma or Degree in Computer Science, Engineering, Electronics or Information Technology;At least 5 years of working experience in managing IT system network operations and support (24×7), service recovery, problem management, risk mitigation and impact assessment;Proven track record with over 5 years of hands-on experience in successfully implementing IT infrastructure projects for LAN and WAN environments;Proficient in installing and configuring a wide range of network technologies, including LAN, WAN, VoIP, WiFi, wireless controllers, access points, firewalls, security gateways, VPNs, 802.1x protocol, VLANs, and L2/3 switches;Skilled in using monitoring, network diagnostic, and network analytics tools to ensure optimal network performance and troubleshoot issues efficiently;Experience in project and vendor management;Excellent communication and interpersonal skills, with the ability to explain technical concepts to non-technical users;Strong problem-solving skills and the ability to work independently and collaboratively in a team environment.",
        "desirable_skill_list": "Professional and technical certifications that include CCIE, CCNA, CCDP, CCNP, ITIL, CISSP, AWS Certified Solutions Architect.",
        "responsibility_list": "Lead and manage the network operations, incident handling, maintenance, compliance, and renewal of IT infrastructure systems (Wired/Wireless) to ensure all systems are working in good condition to maintain normal operations;Ensure proper project and change management to ensure delivered solutions meet technical, functional, performance and business requirements;Responsible to detect signs of abnormality and to report overall system health status to ensure recovery actions, correction actions and preventive measures are in place for every incident reported;Be the point of contract to attend to any incident/problem reported and to provide the impact assessments on the outage;Work closely with vendors on mitigation measures and assist to resolve the issues and investigation for root cause;Maximizing network performance through ongoing monitoring and troubleshooting;Ensuring peak network performance through continuous monitoring and effective troubleshooting;Scheduling and coordinating network upgrades while investigating network faults;Ensuring network equipment is up-to-date with the latest firmware releases;Perform system maintenance and deliver regular network status reports to key stakeholders."
    },
    {
        "title": "Project Management Officer",
        "description": "We are looking for a Project Manager with extensive experience in the Treasury and Financial Services sector, specializing in managing large-scale projects that enhance operational efficiency and compliance.",
        "company": "Suntec Singapore",
        "monthly_pay": 9500,
        "address": "3 Temasek Blvd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "University degree in Business Management, Information Systems/Technology, or Finance from a recognized institution;Minimum of 5 years managing large-scale projects in a global financial institution, with end-to-end responsibility;Strong influencing, negotiation, and communication skills; proficiency in MS Office applications;Ability to manage multiple initiatives and work under deadlines, with a proactive approach to problem-solving;Should have working experience with Treasury and/or Wholesale;Self-starter with the ability to work effectively across diverse cultures and teams.",
        "desirable_skill_list": "Project management and/or Agile certifications (Product Owner or Scrum Master).",
        "responsibility_list": "Lead the development and execution of comprehensive project plans, adjusting as necessary to meet evolving business needs;Drive project scoping and the creation of business case and requirements documentation, ensuring alignment with business objectives;Manage relationships with project teams, sponsors, and stakeholders across front, middle, and back office functions, facilitating collaboration and communication;Analyze and improve business processes in line with best practices and regulatory compliance, ensuring efficiency and effectiveness;Oversee project resources, budget, scope, risk, schedule, and performance, effectively addressing issues and escalations;Maintain key project documentation throughout the lifecycle and produce detailed reports for senior management on project milestones and status;Apply project management methodologies and enforce organizational standards, ensuring successful project delivery;Conduct thorough reviews following project completion to assess outcomes and identify lessons learned."
    },
    {
        "title": "IT Project Coordinator",
        "description": "We are looking for a dedicated and detail-oriented Project Coordinator who will assist in managing multiple IT projects in a banking environment.",
        "company": "Mapletree Commercial REIT",
        "monthly_pay": 10500,
        "address": "8 Marina Blvd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology or related field;At least 2 years of working experience as a IT project manager;With initiatives and experience in driving project schedule and timeline in the banking industry;Detail-oriented approach in handling tasks;Strong organizational and time management skills;Ability to work effectively both independently and as part of a collaborative team;Capacity to adapt to changing priorities and work in a fast-paced environment;Proficient in Microsoft Office and Project so as to manage project related task, track and trace project schedule with the tools;Possess excellent verbal and written communication and interpersonal skills.",
        "desirable_skill_list": "Has a PMP certification.",
        "responsibility_list": "Responsible for managing Information Technology (IT) Application Technology project for Retail / Consumer Banking;Co-ordinate and manage related vendor and stakeholders in accomplishing project goals and assure delivery of project on time, within budget and achieve project scope.Responsible for project planning & execution and managing scope due to any new information and/or changes to initial assumptions, including implications for project time, cost, quality and risk;Develop timelines, track project progress and monitor work plan execution;Involved in Scheduling relevant Project meetings, take notes and prepare the MoM;Support the different testing cycles, analyze the results and submit observations to the Project Manager;Ensure that all Project work is carried out as per the defined program and enterprise methodologies and processes;Create all Project related documentation and participate in Project Steering Committee (PSC) project related walkthroughs;Prepare all Project related reports and highlight risk and issues impacting the project to the Project Manager.Work with the bank's procurement process team in raising work order/SOW and contract management and manage the invoicing and payments process."
    },
    {
        "title": "Product Manager",
        "description": "We are looking for a Product Manager, for an insurance company, who will apply subject matter knowledge in product planning and execution throughout the product life cycle. The individuals in this group should have a keen eye for gaps in consumer product offerings and the innovative mindset to fill them. They are responsible for aligning stakeholders, prioritizing product feature and capabilities and defining a vision for a product.",
        "company": "CapitaMall Trust",
        "monthly_pay": 8500,
        "address": "8 Marina View",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Should hold 6 years to 7 years of product development experience.Has demonstrated experience in life insurance product management.Have strong analytical skills and proficiency in Excel.Should pocess excellent communication and presentation abilities.Has In-depth knowledge of insurance principles and industry trends.",
        "desirable_skill_list": "Have postgraduate degree, preferably in Economics, Statistics, Mathematics, or MBA/Marketing.Competency in competitive benchmarking and maintaining a repository of competition products.Should have expertise in collaborating with channel partners and understanding their business needs.Track record of developing effective sales collaterals and optimizing product positioning.",
        "responsibility_list": "Strategic Planning: Collaborate on the planning, design, and development of product strategies aligning with the company's business objectives.Product Development: Lead the development and filing of new insurance products as per the agreed-upon product planner within specified timelines.Market Analysis: Provide timely publication of Monthly Competition Updates, Segment Analysis, and Competition Benchmarking. Maintain a repository of competition products.Channel Partner Engagement: Regularly meet with channel partners to understand their product needs and offer support to achieve channel business targets.Sales Collaterals: Develop sales collaterals and advisory tools to optimally position products in the market.MIS Preparation: Create and maintain a comprehensive Product Management Information System (MIS) for effective decision-making.Project Collaboration: Assist the project team on various initiatives, ensuring seamless integration of product strategies."
    },
    {
        "title": "Assistant Vice President / Vice President – Distribution and Transformation",
        "description": "We are seeking a visionary leader to take charge of our client's distribution strategy and business planning function for Bancassurance and Third-Party Distribution (TPD) channels. This role is a high-impact position, pivotal to driving the growth and optimization of sales and distribution efforts across key business verticals.",
        "company": "Ascott Residence Trust",
        "monthly_pay": 9000,
        "address": "80 Collyer Quay",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Strong analytical and problem-solving skills with the ability to drive business insights and decisions.Proven experience in managing Bancassurance and Third-Party Distribution setups within financial services or insurance.Exceptional communication and stakeholder management skills, with the ability to influence and collaborate across different teams.Solid understanding of business analytics and its application in driving sales and distribution performance.Strategic thinker with the ability to develop and implement innovative sales schemes and partnership models.Leadership experience, with a track record of mentoring teams and fostering a high-performance work culture.Strong interpersonal skills, with the ability to build lasting relationships with internal and external stakeholders.Ability to work cross-functionally and liaise with Operations, IT, Finance, and Sales teams to deliver results.Qualification : MBA or CA equivalent",
        "desirable_skill_list": "Experience with building and managing large-scale distribution networks.",
        "responsibility_list": "Lead the business analytics function for sales and distribution, driving actionable insights to optimize performance.Design and implement schemes that maximize renewal collections and improve customer retention.Work closely with cross-functional teams including Operations, IT, and Finance to develop and deliver innovative, customer-centric solutions.Build strong relationships with corporate agents, brokers, and partners, ensuring alignment on distribution strategies.Monitor key performance indicators and regularly report progress to senior leadership, adjusting strategies as needed to meet business goals."
    },
    {
        "title": "Cyber Security Specialist",
        "description": "We are looking for a Cyber Security Engineer who will be responsible for monitoring and responding to cybersecurity threats for systems, applications and Infrastructure. This role requires a solid understanding of incident response and security investigations.",
        "company": "CDL Hospitality Trusts",
        "monthly_pay": 11000,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information technology and related discipline;Has at least 5 years in security operations, with a preference for vulnerability assessment & incident management experience;Familiarity with security products and network devices;Capability to perform vulnerability assessments and penetration testing;Experience in preparing tender specifications for security operations centre and creating SOP for incident response;Understanding of TCP/IP, DNS, web, and wireless security architectures;Experience with intrusion detection systems and security event analysis;Ability to engage and communicate clearly with peers in discussions and meetings;Ability to work independently and as part of a team",
        "desirable_skill_list": "CISSP, CISA, CISM CompTIA Security+ or equivalent professional certifications.",
        "responsibility_list": "Analyze security tools, systems , applications and Infrastructure to detect possible weaknesses and suggest potential remediation;Source, manage and oversee the external service providers to conduct annual vulnerability assessment and penetration testing;Follow established procedures to manage security alerts and coordinate with other support teams as necessary;Apply security controls as per industrial best practices, security standards and guidelines such as OWASP top 10, NIST, CIS;Contribute to the development and maintenance of security policies & procedures;Assist in security incident investigations across different locations and environments and be a part of the audit team;Collaborate with the various stakeholders to devise strategies in order to isolate an incident threat, identify the root cause and implement mitigation procedures;Provide project security advisory and ensure overall compliance to security policies in the areas of Security Acceptance Tests, Vulnerability Assessments, Penetration Tests and Security Audits;Submit regular reports on threats, vulnerabilities, and incidents and present on new age systems to be introduced in the organization;Keep abreast with the latest mitigation techniques and technologies."
    },
    {
        "title": "Project Tech Lead",
        "description": "We are looking for a Project Tech Lead to manage applications-related projects activities, ensuring successful delivery and support in a banking industry.",
        "company": "ARA Asset Management",
        "monthly_pay": 10000,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology or related fields;At least 7- 8 years of working experience in implementing applications-related projects in the banking industry;Have good understanding of API and cloud applications on AWS;Good banking knowledge especially in mobile app development, payment process, Balance Transfer and all related applications in the retail banks;Strong analytical and problem solving skills;Detail-orientated with strong stakeholder and customer focus;Ability to work effectively both independently and as part of a collaborative team;Capacity to adapt to changing priorities and work in a fast-paced environment;Proactive and able to work under pressure and positive attitude;Possess excellent verbal and written communication and interpersonal skills.",
        "desirable_skill_list": "AWS Cloud certification;PMP Certified.",
        "responsibility_list": "Collaborate closely with the Project Manager, Project Coordinator, and team lead on delivery of projects;Engage in discussions with stakeholders regarding enhancements to business applications to understand requirements and contribute to the development of effective solutions;Involve in technology-related solutions and delivery of projects for banking applications;Provide support for System Integration Testing (SIT) and User Acceptance Testing (UAT) prior to production deployment;Work effectively with external vendors and internal IT partners to complete necessary assignments;Ensure compliance with external and internal regulatory requirements, internal control standards, and group compliance policies;Oversee the identification, monitoring, reporting, and escalation of project risks and issues;Assist in creating comprehensive application documentation to enhance the bank's knowledge assets."
    },
    {
        "title": "Operations Support-Front Office Trading",
        "description": "We are looking for a specialist consultant having knowledge of financial markets, risk management concepts to provide effective support to the Front Office Trading team. This will be an opportunity to be part of global team within Financial Markets.",
        "company": "Hong Leong Asia",
        "monthly_pay": 9000,
        "address": "80 Raffles Place",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's Degree  in Computer Science, Mathematics, Financial Engineering, Quantitative Finance or a related discipline;Proven experience with front office trading products – Derivatives / Credit Derivatives / Interest Rates Derivatives;Experience in providing functional support to front office traders and risk management teams;Hands on experience in IT Operations / Support including Functional support to end users;Experience in derivates valuation (OIS versus LIBOR), market risk reporting and modelling;Hands on with construction of interest rate, FX and volatility curves and use them to value cash flows;Understanding this for linear derivatives (swaps) is a must;Has analytical skills to identify root causes in workflows incidents which could be data, technical or functional issues;Technical skills: SQL & Linux;A good team player, cross functional, enjoys interacting with people of all levels in a multicultural environment;Excellent stakeholders management skills;Proactive, good communication skills and attentive to details.",
        "desirable_skill_list": "Experience of supporting on real-position management system;Familiarity with Datasynapse, Apache Ignite (GridGain), Google Cloud Platform, Docker and orchestration for it like Kubernetes or Openshift.",
        "responsibility_list": "Manage and oversee incidents during trading activities, lead incident resolution efforts, coordinating with relevant teams and stakeholders to minimize disruptions;Involved in providing functional support for the derivatives platform, ensuring smooth operation of real-time and intraday position management system during ASIA trading hours;Construct interest rate, FX and volatility curves and use them to value cash flows;Drive effective problem management, ensure preventive and detective measures of the applications are identified and resolved through the backlog and communication/ dialogue with the Product Owner;Find opportunities to automate the testing of existing features, performance, and security as well as the automation of deployments, monitoring, and more;Perform Functional testing and Change Management activities to ensure the safe deliveries to Production environment;Conduct user training sessions and create documentation to help user on system functionalities and reporting tools;Work Closely with colleagues from other areas of expertise and take initiative in expanding knowledge (both within and outside of your area of expertise) that is relevant for the area in which you work."
    },
    {
        "title": "Cyber Security Engineer",
        "description": "We are looking for a Cyber Security Engineer for Security Operations Center, person will be responsible for monitoring and responding to cybersecurity threats. This role requires a solid understanding of incident response and security investigations.",
        "company": "GuocoLand",
        "monthly_pay": 11500,
        "address": "7 Wallich St",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information technology and related discipline;Has 2+ years in security operations, with a preference for incident management experience;Familiarity with security products and network devices;Proficiency in network security practices and various operating systems (UNIX, AIX, Linux, Windows);Understanding of TCP/IP, DNS, web, and wireless security architectures;Knowledge of encryption methods (e.g., 2FA, DES/AES/RSA, SSL/TLS) and DMZ development;Experience with intrusion detection systems and security event analysis;Capability to perform vulnerability assessments and penetration testing;Ability to engage and communicate clearly with peers in discussions and meetings.",
        "desirable_skill_list": "Preferred certifications include CISSP, CEH, GCIA, CCNA from EC-Council, GIAC, or (ISC)²;Experience in the banking sector.",
        "responsibility_list": "Track global cybersecurity events and escalate relevant incidents to the Level 2 team;Analyze security tools, including anomaly detection systems, firewalls, antivirus solutions, and proxy devices;Follow established procedures to manage security alerts and coordinate with other support teams as necessary;Execute daily tasks and lead small projects as required;Participate in daily and ad-hoc documentation activities;Create and maintain operational reports for Key Performance Indicators (KPIs) and metrics on a weekly and monthly basis;Conduct assessments as part of the Vulnerability and Threat Management process;Manage and update the Threat Intelligence knowledge base based on subscribed feeds;Assist in security incident investigations across different locations and environments;Collaborate with the Team Lead to enhance SOC methodologies;Ensure timely and accurate closure of all logged tickets;Submit regular reports on threats, vulnerabilities, and incidents;Keep SOC runbooks and procedures up to date."
    },
    {
        "title": "Test Lead",
        "description": "We’re seeking a motivated and detail-oriented Test Lead to drive quality across IT applications and services, ensuring reliable, high-performance solutions. In this role, you’ll lead the testing efforts, design efficient test plans, and develop automated testing processes that align with our technology strategy.",
        "company": "Far East Organization",
        "monthly_pay": 10500,
        "address": "1 Farrer Sq",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Computer Science, Information Technology, or a related field;Have 5+ years of experience in software testing, with a minimum of 2 years in test automation;Strong understanding of software quality assurance processes, methodologies, and tools;Proficiency in test automation tools such as Selenium, JUnit, or TestNG;Experience with Agile and DevOps practices, including CI/CD pipelines;Proficiency with scripting languages (Python, Java, or JavaScript);Strong analytical and problem-solving skill;Excellent communication skills for cross-functional collaboration.",
        "desirable_skill_list": "Knowledge of performance testing tools (e.g., JMeter, LoadRunner);ISTQB or similar certification in software testing;Familiarity with behavioral-driven development (BDD) frameworks.",
        "responsibility_list": "Design and execute robust test plans that cover functional, regression, and automated testing;Identify, document, and track software defects, collaborating with development teams for resolution;Implement and maintain automated testing frameworks to optimize testing processes;Perform regression testing to verify software changes and uphold quality standards;Ensure test environments and tools are updated and meet compliance requirements;Report and communicate test results effectively, providing actionable recommendations;Participate in code reviews, offering feedback on testability and quality improvements;Research and implement innovative testing methodologies to enhance the team’s capabilities;Mentor junior QA team members and support their development."
    },
    {
        "title": "Project Executive",
        "description": "We are looking for a Project Executive to assist our client in supporting their IT infrastructure projects.",
        "company": "SingLand",
        "monthly_pay": 9500,
        "address": "20 Cecil St",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma/Degree in Business Administration, Electrical & Electronics, Computer Science, Software Engineering;Minimum 1 years of experience as project support analyst/co-ordinator related to Engineering and/or Software Development related Projects;Good understanding of project management methodologies, tools, and best practices;Experience in liaising with stakeholders and cross-functional teams;Possesses strong communication skills and excels in time management while effectively managing priorities in a fast-paced environment;Demonstrates strong problem-solving, planning, and organizational abilities;Excellent written and verbal communication skills, complemented by adept presentation skills.",
        "desirable_skill_list": "Agile or PMP certifications.",
        "responsibility_list": "Provide administrative support to Project Managers and within the Project teams, ensuring project deliverables meet corporate quality standards;Assist in supporting project activities, assessments, and reviews and participate in the status meeting;Support Project Managers in budgeting, expense tracking, and cost management;Maintain project documentation, including plans, schedules, and status reports;Ensure compliance with project management methodologies and organizational procedures.Work with the Project Manager to ensure smooth and timely reporting, presentation, and/or analysis;Monitor and report on overall project progress, including milestone and deliverable status across the portfolio;Handle additional ad-hoc duties as needed."
    },
    {
        "title": "Maintenance Manager",
        "description": "We are seeking a driven Application Maintenance cum Support Manager who is competent in project management related to Traffic Engineering and Management and committed to deliver exceptional service.",
        "company": "UOL Group",
        "monthly_pay": 11000,
        "address": "80 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma or Degree in Electrical Engineering, Computer Engineering/Science or Information Technology;Has at least 5 years of relevant experience in Application Maintenace Support and Operations;Must have handled activities like incident management, problem management, release management, root cause analysis, deployment and monitoring;Understand Software Development Life Cycle SDLC, experience working with business users, various IT teams and vendors in managing the project cost and project risk;Experience in IT end-to-end procurement process (i.e. budget approval, tender/quotation, purchase requisition, invoice tracking and verification);Excellent team player with the ability to communicate across all levels within the organization;Positive attitude and able to work under pressure;Excellent technical troubleshooting skills;Strong interpersonal and communication skills.",
        "desirable_skill_list": "PMP and ITIL certifications.",
        "responsibility_list": "Responsible to provide application maintenance support in all stages of the Information Technology (IT) application life cycle related to Traffic Engineering and Management projects.Responsible to handle change requests, service request and incident tickets; ensuring proper ownership and closure of these request/tickets;Responsible to create and secure appropriate approvals for planned and adhoc system changes;Involve in user and system support during and post system implementation;Support IT audit activities when required;Manage the vendors service quality, contract and support standard in accordance to corporate policies and guidelines;Perform escalation procedures to senior levels, annual capacity planning and ensure high availability of system up-time;Collaborate with architect, application delivery teams to drive ITIL best practises through automation and Agile methodology;Ensure compliance to the corporate standards, policies and guidelines related to the application services;Maintain hardware and software assets, annual asset stock take; and to inform management on need for technology refresh before assets are end-of-life;Manage, support and track IT changes activities; provide monthly IT application and operations statistics."
    },
    {
        "title": "Salesforce Technical Consultant",
        "description": "",
        "company": "Wing Tai Holdings",
        "monthly_pay": 10000,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Engineering;Minimum of 5 years of Salesforce development experience, especially with Service Cloud;Good understanding of SFDC fundamental concepts (application, data and security), CRM domain knowledge (Sales Cloud, Service Cloud and Marketing Cloud) and Salesforce Lightning framework;Strong technical foundation in integration components for SFDC, SFDC APIs (SOAP, REST, BULK APIs), Apex controllers, Apex Web Services, Visualforce, Apex callout, inbound & outbound messaging, SFDC data loaders, middleware;Hands-on configuration experience in administration setup, such as managing organisation, users, profiles, roles, security controls, data & support processes configuration;Experience in report & dashboard configuration;Strong analytical and problem solving skills; experience in both process and solution analysis;Strong interpersonal skills, results oriented and ability to work independently and effectively in a global team environment;Ability to multitask effectively and deliver working solutions on a tight schedule and fast-paced environment;Strong oral and written communication skills.",
        "desirable_skill_list": "Salesforce Certification;Service Cloud Consultant certification;Experience with OmniStudio & Omniscript will be a bonus.",
        "responsibility_list": "Responsible for development, testing , implementation and documentation of Salesforce application;Design custom objects, custom fields, picklists, page layout, workflow, approval processes, validation rules & flow;Handle change request and implement enhancements using Salesforce frameworks and Apex;Conduct analysis and configuration of Salesforce, implement, and test the platform-specific solutions, and/or other related packages and add-ons;Develop and maintain integrations between SFDC and 3rd party services (eg. APIs, middleware);Migrating/Deploying codes and SFDC components using out of the box and/or other deployment tools;Document faults, implement resolution & retests, to agreed standards;Able to adapt to the fast-changing environment and ambiguous situation;Identify areas of improvement and develop mitigation plans."
    },
    {
        "title": "Finance Analyst",
        "description": "We are looking for a finance analyst experienced and Proficient in Microsoft Office, particularly Microsoft Excel.",
        "company": "City Developments Limited",
        "monthly_pay": 12000,
        "address": "120 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Accounting, Business, Finance, or a related discipline is preferred;Familiarity with treasury products, derivatives, and options is advantageous;Strong proficiency in Microsoft Office, especially Excel;Excellent team collaboration skills;A solid understanding of control processes and a curious mindset;Ability to link product control activities with the strategic objectives of the desks.",
        "desirable_skill_list": "Familiarity with treasury products, derivatives, and options is advantageous;GLAO certification on Balance Sheet accounts.",
        "responsibility_list": "Produce daily P&L reports and perform P&L decomposition;Provide commentary on significant P&L drivers and relate them to the business strategies of the desks;Monitor new deals, late deals, and market operations;Conduct checks for transactions executed at off-market rates and provide justifications;Monitor exceptions between reported P&L vs. trader estimates and identify breaches of threshold limits for unexplained P&L attributions;Reconciliation of PL between Management reporting vs General Ledger."
    },
    {
        "title": "Project Manager",
        "description": "We are looking for a Project Manager experienced in business project management skills and prior experience with financial products.",
        "company": "Allgreen Properties",
        "monthly_pay": 11000,
        "address": "100 Cecil St",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Business Administration, Project Management, Finance, or a related field;Proven experience in project management, with a focus on business initiatives;Prior experience in managing projects related to financial products is Mandate;Strong communication and interpersonal skills, with the ability to engage effectively with diverse stakeholders;Solid understanding of financial management principles as they relate to project delivery;Proficiency in project management tools and software;Oversee project financials, ensuring they are accurately updated and captured in a timely manner.",
        "desirable_skill_list": "PMP Certified.",
        "responsibility_list": "Lead and manage projects to ensure timely delivery within budget constraints, utilizing best practices and methodologies;Work closely with stakeholders across business units and technology teams to ensure alignment on project objectives, deliverables, and timelines;Provide regular updates to stakeholders, facilitating transparent communication regarding project progress and addressing any concerns;Monitor and follow up on action items to ensure timely resolution and adherence to project timelines;Oversee project financials, ensuring they are accurately updated and captured in a timely manner. Conduct regular reviews to track budget adherence and financial forecasting."
    },
    {
        "title": "RPA Project Manager",
        "description": "We are seeking an experienced RPA Project Manager to lead Robotic Process Automation (RPA) initiatives. This role involves managing end-to-end RPA implementations to enhance operational efficiencies and achieve cost reductions through automation.",
        "company": "Hoi Hup Realty",
        "monthly_pay": 9000,
        "address": "38 Beach Rd",
        "remote": false,
        "job_type": "Internship",
        "mandatory_skill_list": "Has 8 years and above of experience in RPA;Strong background in technical support for RPA solution and is capable of building custom automations;Hands on experience in C#.Net;Expertise in leading automation initiatives to enhance business processes, drive efficiency, and reduce costs;Proficient in leading and influencing cross-functional teams;Familiar with various project management methodologies;Strong stakeholder management skills, capable of driving change effectively;Experienced in developing and deploying advanced RPA solutions;Proficient in RPA platforms such as UiPath, Automation Anywhere, and Blue Prism.",
        "desirable_skill_list": "Have relevant RPA certification such as UiPath Certified/ Automation Anywhere Certified Advanced/ RPA Professional/ Blue Prism Developer/ Professional Certification.",
        "responsibility_list": "Lead the comprehensive RPA strategy and execution from start to finish, preferably with experience in the insurance industry.Implement RPA initiatives and automation projects end-to-end to increase operational efficiency and reduce process costs.Foster cross-functional collaboration to identify and drive automation success.Partner with cross-functional teams, including underwriting, claims, and customer service, to gather detailed requirements, conduct thorough workflow analyses, and implement tailored automated solutions for significant operational enhancements.Design, develop, and maintain RPA workflows using tools such as UiPath or Blue Prism.Establish RPA best practices by developing and maintaining robust frameworks, standards, and best practices specific to the insurance industry, ensuring high-quality solutions while maintaining compliance with regulatory requirements.Manage projects from the initial requirements-gathering phase through to project completion.Optimize project delivery by collaborating closely with various business units to identify automation opportunities, analyze existing insurance processes, and define comprehensive requirements, leading to improved project delivery times and outcomes.Provide team leadership and development for team members and direct reports.Design and implement training programs to enhance team skills in RPA tools and methodologies, fostering a culture of continuous learning and innovation."
    },
    {
        "title": "System Analyst (.NET)",
        "description": "We are seeking an Analyst Programmer (.NET) to support and develop software applications for our client’s organization.",
        "company": "Lendlease",
        "monthly_pay": 10500,
        "address": "1 Marina Blvd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Engineering, and/or Computer Science;At least 3 years of experience in systems analysis, design (include database design), C#.NET development, implementation, and quality assurance;Proficient in using C#, ASP/ASP.NET, AJAX, HTML, SAML for web development and maintenance;Familiarity with databases (SQL, NoSQL) and data integration;Knowledge on Python and cloud services ( AWS, Azure);Good knowledge in Object Oriented Analysis and Design, Net technologies and tools;Good experience working with Contact (Call) Centre systems such as Amazon Connect;Excellent communication and interpersonal skills, with the ability to collaborate effectively in a team environment.",
        "desirable_skill_list": "Certified .NET Developer;Working experience in Dynamic 365 and / or Amazon Connect.",
        "responsibility_list": "Responsible for design and implementation of Microsoft (.NET) systems;Gather and analyse user requirements and translate them into application specifications;Analyse, design, test, implement, and maintain application systems or web-based applications;Prepare detailed technical documentation using Jira and Confluence to ensure effective communication;Conduct unit testing on software deliverables and assist in product, integration, and user acceptance testing;Provide post-implementation support, investigating and troubleshooting issues to ensure uninterrupted operation;Any other ad-hoc responsibility_list assigned."
    },
    {
        "title": "Technical Lead",
        "description": "Our client within the banking industry is looking for an experience Tech Lead to work closely with Project Manager to manage and deliver multiple IT projects in Retail Banking.",
        "company": "CapitaLand Development",
        "monthly_pay": 9500,
        "address": "8 Marina View",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science or Engineering or Information Systems;At least 5 years' experience with project management, business analysis, application development and deployment in Banking Industry;Has experience as a Developer/Technical analyst responsible for end to end system capability analysis;Support payment related applications on the API and related platforms;Good business experience in Bank Transfer and Payment function related to account opening, internet and mobile banking, channels (ATM, Credit Cards), Payment Gateway (Paynow);Proven track record in delivering and managing the complex banking projects in waterfall and agile methodology;Strong stakeholder management skills and able to communicate with senior level;Ability to drive and motivate the team to meet tight deadlines;Able to work as a team with active participation in team discussion, and also able to work independently to handle multiple tasks assigned;Proactive and able to work under pressure and positive attitude;Excellent verbal and written communication skills;Prior experience in vendors selection and management;Has strong leadership abilities and interpersonal skills;Solid project organizational skills including attention to detail and multi-tasking skill.",
        "desirable_skill_list": "PMP Certified;Scrum Certified.AWS Cloud certification will be an advantage",
        "responsibility_list": "Support Project Manager(s) in ensuring project delivery on time on schedule and with quality;Provide and deliver end-to-end application development and production support technology services, locally and regionally;Engage in project conceptualization, defining project scope and providing business solutions;Prepare and manage work plans, schedules, project estimates/budget, resource plans and status reports on a regular basis;Manage the scope change process with identification of risks and issues, and facilitate resolution, mitigation and prioritization;Provide support to System Integration Testing (SIT) and User Acceptance Testing (UAT), prior to production deployment;Collaborate with external vendors, internal partners and business stakeholders in delivery the final outcome;Liaise with stakeholders, providing regular project status update;Ensure adherence to schedule and standards by team members and vendors throughout the cycle of the project;Collaborate with global and cross functional technology partners to develop and implement programs, projects or processes to address current and future business needs;Ensure proper application delivery sign-off and contribute to proper application documentation."
    },
    {
        "title": "System Analyst",
        "description": "We are seeking a skilled System Analyst with substantial experience in the banking industry. This is a great opportunity to manage the end-to-end deployment and delivery of IT Infrastructure for various projects.",
        "company": "M+S Pte Ltd",
        "monthly_pay": 11500,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in computer science, information technology, or other related field;Possesses over 10 years of professional experience, preferably in banking environments;Proficient understanding of ITIL processes;Provide 24/7 UAT (User Acceptance Testing) Systems and Production support to ensure seamless operation and timely resolution of issues;Knowledge of Middleware components, including JBOSS, APACHE, WebSphere Application Server, and IHS; support installation, configuration, and maintenance of these components;Possesses operational experience, ideally in supporting critical application systems;Strong infrastructure and technical background, with expertise in Open Systems platforms, firewalls, load balancers and a solid understanding of information security principles;Demonstrates effective leadership skills, collaborating with application teams and service providers;Excellent verbal and written communication skills.",
        "desirable_skill_list": "Familiarity with Vulnerability Threat Management (VTM) processes, with the ability to track and report on overall VTM schedules and remediation efforts;",
        "responsibility_list": "Manage end-to-end deployment and delivery of IT infrastructure for projects, encompassing deployment planning, setup and testing, pre-production readiness, and production cutover;Collaborate with Solution Engineers, application teams, infrastructure SMEs, and service providers to meet project objectives;Prepare and submit necessary change requests and requisitions for infrastructure deployment, including facility/VM requests, IP/DNS/Hostname requests, and SAN requisitions;Deploy infrastructure setups in accordance with bank policies, standards, and approved solution designs;Manage risks and escalations encountered during project deployment, driving towards effective resolutions;Achieve target SLAs for infrastructure provisioning and complete project deployments per agreed schedules and plans;Ensure disaster recovery (DR) readiness in compliance with bank policies;Interface with Infrastructure, Project Management, and Application Development teams to facilitate infrastructure setup readiness;Manage firewall changes according to application requirements, and oversee DNS and SLB configuration requests;Configure Akamai for existing URLs, including DNS changes, firewall modifications, and link proof adjustments;Support IHS changes, including proxy configurations, SSL protocol disabling, cipher changes, and change requests."
    },
    {
        "title": "IT Engineer – MES",
        "description": "",
        "company": "Pidemco Land",
        "monthly_pay": 10000,
        "address": "1 Raffles Quay",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Computer Engineering;At least 2 years of experience in supporting Manufacturing Execution System (MES) applications (e.g., Siemens Opcenter, Rockwell FactoryTalk);Proficiency in programming languages such as SQL, Python, or C#;Working knowledge in Unix scripting;Good understanding in application server, client application and database (i.e. Oracle);Independent and proactive yet a strong team player;Excellent spoken and written communication skills.",
        "desirable_skill_list": "Experience in Tibco (TIB / RV) in high technology manufacturing environment.",
        "responsibility_list": "Provide L2 and L3 support for production systems, focusing on monitoring, maintaining, and continuously improving the Manufacturing Execution System (MES);Ensure the proper operation of production lines concerning products, routes, operations, equipment, recipes, and lot movements;Analyze user requirements to perform MES modeling and configuration for changes in material flow;Participate in User Acceptance Testing (UAT) and System Integration Testing (SIT) to validate system performance and functionality;Offer both user and system support during pre-implementation and post-implementation phases to ensure a smooth transition and operation;Ensure that development tasks are completed on time, adhering to corporate policies and guidelines, with proper documentation;"
    },
    {
        "title": "Team Lead",
        "description": "We are looking for a highly experienced and dynamic Team Lead to join our esteemed global financial institution. The successful candidate will be responsible for leading a team of talented Java developers in creating robust, scalable, and efficient software solutions that power our critical financial systems.",
        "company": "Wee Hur Development",
        "monthly_pay": 8500,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Bachelor’s degree in Computer Science, Information Technology, or a related field;At least 7+ years of experience in Java development;Minimum of 3 years of experience in a leadership role, preferably in the financial services industry;Strong expertise in Java, Spring Framework, Spring Boot, Hibernate, and related technologies;Proficiency in microservices architecture, RESTful API development, and cloud platforms (AWS, Azure, etc.);Understanding of SOAP, GraphQL, and API versioning strategies;Experience with CI/CD pipelines, version control systems (Git), and containerization (Docker, Kubernetes);Strong problem-solving abilities and a proactive approach to challenges;",
        "desirable_skill_list": "Understanding of security concepts like authentication, authorization, encryption, and secure coding practices;Strong communication skills with the ability to interact effectively with technical and non-technical stakeholders;",
        "responsibility_list": "Lead and manage a team of Java developers in the design, development, and maintenance of complex financial applications;Collaborate with stakeholders to define project requirements, scope, and timelines;Oversee code reviews, ensure adherence to coding standards, and promote best practices in software development;Provide technical guidance and mentorship to team members, fostering a collaborative and high-performance culture;Contribute to architectural decisions and participate in the evaluation of new technologies and tools;Ensure the successful delivery of projects by monitoring progress, managing risks, and resolving issues in a timely manner;Work closely with other teams (QA, DevOps, Product Management) to ensure seamless integration and delivery of solutions;"
    },
    {
        "title": "Senior Business Analyst",
        "description": "Excellent opportunity for a Senior Business Analyst to be part of the Change Management Team to manage major and strategic change initiatives work for a leading Financial Services organization.",
        "company": "SingHaiyi Group",
        "monthly_pay": 9000,
        "address": "100 Cecil St",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology / Finance/ BusinessAt least 8 years of working experience as a Business Analyst in a project setting within Financial Services Industry;Experience and knowledge of change and project management principles, methodologies and tools;Solid understanding on change management process;Good understanding of Wholesale banking products, process, and technologies solutions;Working experience in Wholesale payment process and SWIFT messaging are required;Proficient in gathering and documenting business requirements, creating functional specifications, and user stories;Excellent analytical and problem-solving skills, with the ability to think critically and strategically;Strong interpersonal and communication skills, with the ability to effectively communicate complex ideas to both technical and non-technical stakeholders;Strong attention to detail and ability to manage multiple priorities and deadlines;Must be able to work independently and collaboratively in a fast-paced environment.",
        "desirable_skill_list": "PMP / Scrum certified.",
        "responsibility_list": "Collaborate with stakeholders to understand business change initiatives, objectives, requirements, and challenges;Gather and document user requirements and translate it into functional specifications and user stories;Conduct impact analyses, assess change readiness, and perform gap analysis to identify discrepancies between current and desired states and propose solutions to bridge the gaps;Perform risk assessment with project implementation; identify and manage project dependencies;Develop and maintain business process models, use cases, and other relevant documentation;Conduct feasibility studies and cost-benefit analysis to evaluate potential solutions and make recommendations to stakeholders;Collaborate with technical teams to ensure accurate translation of business requirements into technical specifications;Facilitate user acceptance testing (UAT) and support end-users during the implementation and post-implementation phases;Maintain regular updates with other (change) business analysts across the region for alignment and updates on the project status, risk and issues;Collaborate with stakeholders to continuously improve business processes, systems, and workflows."
    },
    {
        "title": "UX Designer",
        "description": "Seeking an outstanding User Experience (UX) Lead, to join our team to resolve UX challenges and to distil complex issues into useful and intuitive design solutions.",
        "company": "SLP International",
        "monthly_pay": 12000,
        "address": "38 Beach Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma / Degree in Computer Science, Design, Human Computer Interactions or Psychology;At least 8 years experience as User Experience (UX) experience;Experience with Figma, Balsamiq, Axure, Sketch, Photoshop, Illustrator, inVision, Zeplin or other visual design and wireframing tools;Proven graphic design experience with a portfolio of work that demonstrates strong experience in service design, design research, interaction design and product strategy;Prior hands on experience in large portal/web based/mobile applications user design experience;Strong facilitation skills and experience facilitating workshops with large groups;Familiar with the latest interface design trends and best practices;Ability to maintain high level of initiative, think out of the box and to work independently;Should have the ability to innovate, visualize and create excellent customer experience through the design;Experience in Agile and UX development environment;Ability to interact, communicate and present ideas.",
        "desirable_skill_list": "Experience in Human Computer Interactions;Experience in frontend development/web development technologies such as HTML/HTML5, CSS, JavaScript, and Responsive Web Design.",
        "responsibility_list": "Play a key role in conceptualising products, designing how these products work, as well as their final look and feel;Work closely with business and technology stakeholders to understand their goals and challenges and propose a user centric approach;Create research and design artefacts and documentation including research reports, storyboards, user flows, process flows, site maps, wireframes, interactive prototypes, and final screen designs to actualize the larger vision of the product;Lead discussions on user research and visual design;Establish and promote design guidelines, best practices and standards;Liaise with system developers throughout the SDLC (Agile) to create a design minded environment and to ensure common understanding;Ensure to incorporate usability and good customer experience into products and services with alignment to corporate design standards and guideline;Assist product owner in the development of user guides / manuals / training materials;Drive and guide the execution of design vision and consistency across different products and services."
    },
    {
        "title": "Business Analyst",
        "description": "We are looking for a Business Analyst with experience in the payments domain to join the Reconciliation Operations team.",
        "company": "KSH Holdings",
        "monthly_pay": 11000,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Business,  Finance or equivalentExperience in Payments, Remittances, Telegraphic Transfer Operations;Exposure and  knowledge in SWIFT, Payment Messages like PACS008/009, MT103/202/900/910 and CAMT series;Must have worked as a Project Assistant role;Possess good stake holder management skills and experienced to collect, analyse data, draw insights and make recommendation;Good leadership and administrative skills;Excellent communication skills to interact with Project teams efficiently",
        "desirable_skill_list": "Work experience in banking industry.",
        "responsibility_list": "Responsible for analyzing and providing inferences on specialized Payment functions related to SWIFT and payment messages;Support the Project manager effectively on administrative and logistical tasks;Closely work with the Project team for successful on-time Project delivery;Track Project progress and monitor work plan execution;Involved in Scheduling relevant Project meetings, take notes and prepare the MoM;Articulate business case scenarios and contribute towards the development and scoping of the Project;Coordinate with surround Project team members to achieve project objectives;Support the different testing cycles, analyze the results and submit observations to the Project Manager;Ensure that all Project work is carried out as per the defined standards and procedures;Create all Project related documentation and participate in project related walkthroughs;Prepare all Project related reports and highlight risk and issues impacting the project to the Project Manager."
    },
    {
        "title": "Business Transformation Manager",
        "description": "We are seeking an experienced Business Process Transformation Manager cum Business Analyst to be involved in a large scale (fast pace) operational transformation project and to support the operational and strategic initiatives through meticulous process engineering and business analysis.",
        "company": "Heeton Holdings",
        "monthly_pay": 9500,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Banking, Business, Finance or Economics, Information Technology,At least 10 years of working experience in project management or PMO management experience in the banking industry;Must have 5+ years of Project Governance and Quality Assurance;Good experience in innovative or economically driven environment, working on Business Process Management/ Business Process Re-engineering projects;Experience in creating and maintaining project and programme plans, including risks, actions, issues, dependencies;Exceptional stakeholder management skills and ability to manage project team members across multiple business units;Knowledge of benefits and dependency mapping, risk management and resource planning;Proven success of working effectively in a cross-functional team in an international environment;Good understanding or analytical skills in uncovering new opportunities for collaboration;Excellent communication skills, emotional intelligence, and ability to influence key decisions, mediate conflicts, and build consensus both internally and externally;Strong skills in communication, consulting, negotiation, and conceptualization.",
        "desirable_skill_list": "Work experience in consulting firm for banking clients.",
        "responsibility_list": "Be a part of the operational banking team in the capacity of a project manager cum business analyst;Engage with various stakeholders and business project teams in initiatives focused on Operational transformation;Run Business Process Re-engineering workshops (interviews) with stakeholders to elicit and validate the business requirements to align with corporate strategic business goals;To quickly respond to issues raised, through good understanding of business, operational and technical considerations, and recommend sound solutions;Articulate business case scenarios and contribute towards the development and scoping of the Project;Coordinate with surround Project team members to achieve project objectives;Ensure that all Project work is carried out as per the defined standards and procedures;Implement project governance standards including tracking, monitoring and updating the status of programme or project deliverables;Create all Project related documentation and participate in project related walkthroughs;Prepare all Project related reports and highlight risk and issues impacting the project to the Management."
    },
    {
        "title": "Java Developer",
        "description": "Are you ready for a challenging role? We're seeking a Java Developer to join our team and contribute to an exciting project focused on developing innovative custom-built applications. This opportunity allows you to showcase your Java expertise while collaborating with a dynamic team to deliver cutting-edge solutions that make a real impact.",
        "company": "Hong Realty",
        "monthly_pay": 10500,
        "address": "80 Raffles Place",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology or related discipline;At least 2-5 years of experience in software development using Java / Spring Boot and associated technologies;Must have experience in the end to end software development life cycle (SDLC)  along with documentation;Skilled in providing post-implementation support and conducting investigation and troubleshooting;Familiarity with JPA (Java Persistence API) and Hibernate;Solid understanding of relational database concepts;Hands-on SQL experience, preferably with MS SQL;Proficiency in using Git and understanding of Git workflow;Experience working in Agile Scrum teams;Should have strong communication skills both written and spoken.",
        "desirable_skill_list": "Exposure to Jenkins for continuous integration;Familiarity with Kubernetes;",
        "responsibility_list": "Develop, maintain and support custom-built software applications using Java / Spring Boot and associated technologies;Prepare comprehensive technical documentation using Jira and Confluence to ensure clarity and maintainability of software solutions;Perform thorough unit testing on software deliverables and collaborate effectively during product test, integration test, and user acceptance test phases;Provide proactive post-implementation support, including investigating and troubleshooting issues as they arise;Undertake ad-hoc responsibility_list as required, demonstrating flexibility and readiness to contribute to various aspects of software development and maintenance;Collaborate closely with cross-functional Agile Scrum teams to ensure alignment on project goals and timelines;Continuously improve software development processes and practices to enhance efficiency and product quality."
    },
    {
        "title": "Site Reliability Engineer",
        "description": "We are seeking a highly skilled Site Reliability Engineer (SRE) to join our team. As an SRE, you will play a critical role in enhancing system reliability, performance, and scalability while ensuring the seamless functioning of our production environments. This is an opportunity to work in a fast-paced, dynamic environment and make  a significant impact.",
        "company": "EL Development",
        "monthly_pay": 9000,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree in Computer Science or Engineering or Information Systems;At least 10+ years of experience in system administration, SRE, or DevOps roles;Strong expertise in Unix/Linux systems and databases such as MySQL, MariaDB, SingleStore, or MongoDB;Experience with high availability and high-scale systems;Proficiency in Python and Unix scripting for automation;Experience with incident management, including post-incident retrospectives and resolution;Knowledge of cloud platforms and modern monitoring tools such as Prometheus, Grafana, or equivalent.",
        "desirable_skill_list": "Familiarity with database backup, archiving, and system performance tuning;Ability to work in a fast-paced environment, driving continuous improvement in system performance and reliability.",
        "responsibility_list": "Develop, implement, and monitor solutions that improve reliability and performance of production services;Manage and resolve production incidents, ensuring minimal downtime and documenting post-incident reviews;Automate repetitive tasks, streamline deployment processes, and continuously enhance operational efficiency;Work closely with development, operations, and product teams to design scalable and reliable infrastructure solutions;Utilize monitoring and alerting tools to track system performance, availability, and scalability, ensuring timely responses to potential issues;Ensure all deployed systems adhere to security and compliance standards, managing potential vulnerabilities and security risks."
    },
    {
        "title": "DevOps Engineer",
        "description": "We’re looking for a dynamic and innovative DevOps Engineer to join our team! If you're passionate about cloud technologies, automation, and optimizing system performance, this is the opportunity for you. In this role, you’ll design and automate deployment processes, enhance cloud-based systems, and work closely with a collaborative, cross-functional team to deliver impactful solutions.",
        "company": "Treasure Holdings",
        "monthly_pay": 10000,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology and related Discipline;Has Google Cloud certification as a Professional Cloud Developer or Cloud Architect;Have minimum 5+ years of experience in DevOps engineering, with at least 2+ years of hands-on experience with Google Cloud Platform (GCP);Experience with cloud platforms like AWS, GCP, or on-premises infrastructure;Strong understanding of cloud architecture, migration, and deployment strategies;Proficiency in programming languages such as Java, Python, or C++;Familiarity with agile development methodologies and version control systems like Git;Excellent problem-solving skills and attention to detail.",
        "desirable_skill_list": "Knowledge of DevOps practices and tools like Jenkins, Docker, or Kubernetes;Familiarity with machine learning and data analytics concepts.",
        "responsibility_list": "Design, build, and manage secure, scalable, and efficient cloud-based systems on Google Cloud Platform (GCP);Develop and deploy cloud-native applications using services such as Compute Engine, App Engine, Kubernetes Engine, and Cloud Storage;Lead the migration of on-premises infrastructure to GCP, ensuring minimal downtime and optimal resource utilization;Implement and maintain security measures, including Identity and Access Management (IAM) and compliance with regulatory requirements;Collaborate with cross-functional teams to understand business needs and develop effective technical solutions;Monitor, log, and optimize system performance using tools like Stackdriver and Cloud Monitoring;Stay up to date with GCP innovations and best practices to continuously improve cloud architecture."
    },
    {
        "title": "Project Management Officer (PMO)",
        "description": "We are looking for a dynamic Project Management Officer who will be driving digital servicing projects execution and strategic alignment across teams to deliver impactful results.",
        "company": "Kingsmen Creatives",
        "monthly_pay": 9500,
        "address": "20 Cecil St",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma or Bachelor’s Degree in Computer Science, IT, Engineering, or a related discipline;Has at least 2 years of working experience as a Project Assistant/PMO;Has a good knowledge of Software Development Lifecycle (SDLC) and AI;Able to provide after-hours and weekend/public holiday support for system releases during off-peak times;Proficient in using tools such as Microsoft 365, Jira, Confluence, Figma;Experience of working with cross-functional teams, including IT and Compliance;Capable of analyzing situations to make informed decisions;Good at communicating and presenting technical information in a clear and unambiguous manner;Strong ability to work independently and cooperate with diverse teams in a multiple stakeholders environment.",
        "desirable_skill_list": "Prior experience in Agile Project Management/Customer Service is a plus;Work experience in banking industry.",
        "responsibility_list": "Support and drive Generative AI initiatives to enhance Contact Centre operations, employee journey, and overall customer experience;Ensure smooth delivery of Contact Centre system enhancements in Corporate Banking (e.g., CRM, telephony) through thorough testing and issue resolution;Prepare test cases based on user requirements, execute test cases, and collaborate with developers to resolve issues before release;Take strong ownership of assigned projects, ensuring tasks are completed within the project timeline;Coordinate with Project team members to achieve project objectives."
    },
    {
        "title": "Application developer – C++/C#",
        "description": "We are looking for a highly skilled and experienced C++/C# Developer to be a part of Global Financial Markets (GFM) team and work as Front Office quant developer.",
        "company": "Soilbuild Group Holdings",
        "monthly_pay": 11500,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Mathematics, AI, Computer Science, Engineering, or other related field.Strong skills in object-oriented programming languages, particularly C++ or C#.Experience in driving end to end SIT/UAT/Prod defects;Experience with relational database systems (e.g. SQL);Must have working experience as a quant developer;Strong communication and analytical abilities are necessary to collaborate effectively and solve complex problems;Ability to work in a fast-paced, front-office trading environment with tight deadlines;Good at communicating and presenting technical information in a clear and unambiguous manner;Strong ability to work independently and cooperate with diverse teams in a multiple stakeholders environment.",
        "desirable_skill_list": "Knowledge or experience with distributed computing technologies such as AWS, Microservices, API, Redis, and Linux.Experience with source control, continuous integration, and profiling tools.Familiarity with financial engineering concepts.",
        "responsibility_list": "Build and Improve Systems: Create and upgrade pricing engines and other tools using modern technologies like APIs, cloud services, and microservices to support trading activities.Write and refine code for features, applications, and APIs using languages such as C#, Python, C++, and SQL to enhance trading operations.Troubleshoot and fix any problems in the system across various stages (testing and production) to ensure everything runs smoothly.Work on optimizing the performance of trading models and systems to make them faster and more efficient.Oversee the entire software development process, from planning and coding to deploying and maintaining the systems.Work closely with traders and quantitative analysts directly on the trading floor to understand their needs and provide technical support.Coordinate with the bank’s IT teams to ensure that all systems integrate well with existing infrastructure and meet technical requirements.Keep up with the latest technological advancements and financial trends to continually improve and update trading systems."
    },
    {
        "title": "Murex Flex Developer",
        "description": "We are looking for a highly skilled and experienced Murex Flex Developer to be a part of Global Financial Markets (GFM) team and work as quant developer.",
        "company": "Oxley Holdings",
        "monthly_pay": 10500,
        "address": "1 Raffles Quay",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Mathematics, AI, Computer Science, Engineering, or other related field;Proficient in Murex Flex technologies for developing and managing derivative products;Understanding of Murex functionalities and workflows in global financial markets;Strong experience in C++ for quantitative modeling and system optimization;Knowledge of relational databases (e.g., SQL, Oracle) for data management and analysis;Understanding of the full software development lifecycle (SDLC), including Agile methodologies;Experience with source control (e.g., Git), continuous integration, and deployment practices;Self-motivated with a strong work ethic and ability to meet tight deadlines.",
        "desirable_skill_list": "Familiarity with concepts in financial engineering is an advantage;Familiarity with other programming languages such as Python or Java is a plus.",
        "responsibility_list": "Design and develop new derivative products using Murex Flex technologies to meet market demands and enhance trading capabilities;Analyze and optimize the performance of quantitative models and systems, ensuring high efficiency and reliability;Investigate and resolve defects identified during System Integration Testing (SIT), User Acceptance Testing (UAT), and in production environments, ensuring minimal disruption to operations;Drive the end-to-end software development life cycle, from requirements gathering and design to implementation, testing, and deployment;Collaborate closely with traders and quantitative modelers on the trading floor to gather requirements and provide insights into model performance and usability;Provide technical support and training to end-users and team members, fostering a strong understanding of the tools and models developed;Identify potential risks related to system performance and model accuracy, implementing measures to mitigate these risks effectively."
    },
    {
        "title": "Business Analyst",
        "description": "We are hiring for a Business Analyst to drive solutions and improve operational procedures while managing compliance and vendor relationships. Collaborating with internal stakeholders and external partners, you'll implement efficient workflows and support key fund events and reporting.",
        "company": "SC Global Developments",
        "monthly_pay": 9000,
        "address": "100 Cecil St",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Finance/Business Administration;Strong understanding of Variable Capital Company (VCC) regulations and investment operations;Proven experience in managing projects, from initiation to execution and closure;Ability to analyze complex data and assess operational risks effectively;In-depth knowledge of regulatory requirements and compliance protocols;Excellent verbal and written communication skills for liaising with internal and external stakeholders;Strong aptitude for identifying issues and developing innovative solutions.",
        "desirable_skill_list": "Prior experience in managing budgets related to vendor contracts and operational projects.Experienced in preparing and delivering effective presentations for stakeholder meetings.",
        "responsibility_list": "Work closely with front office in GFM as a Business Manager to drive solutions, improve procedures/infrastructure for the Variable Capital Company (VCC) business and implement end to end systematically captured workflows;Liaise with internal stakeholders and external service providers/brokers for the setup and maintenance of trading accounts;Work with Fund Administrators and Custodians to support fund events, asset transfers and month end reporting;Initiate negotiations and management of external service contracts with vendors to ensure that service level agreements are being met along with instigate RFP’s and due diligence on new vendors/service providers are done periodically per contract end;Review and work with business and support units to ensure VCC’s compliance with regulatory requirements, including maintenance of registers and records;Support and coordinate with relevant parties on operational risk reporting, tax/regulatory filings, audit, insurance related matters;Perform assurance or risk /control related testing."
    },
    {
        "title": "Data Engineer",
        "description": "An exciting opportunity for Data Engineer to be a part of a project for strategic initiatives in architecting, designing and building next-generation cloud-based data platforms.",
        "company": "Sim Lian Group",
        "monthly_pay": 10000,
        "address": "38 Beach Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Data Engineering, Computer Science, Information Technology;At least 5 years of experience in data engineering and modelling;Strong hands-on exposure in data science, data analytics and / or data engineering;Deep understanding of system design, data structure and algorithms, data modelling, data access, and data storage;Advanced SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases;Good understanding in using cloud technologies such as AWS, Azure, and Google Cloud;Experience with orchestration frameworks such as Azure Data Factory, Airflow;Experience with distributed data technologies such as Spark, Hadoop;Proficiency in programming languages such as Python, R, Java, or Scala;Familiarity with building and using CI/CD pipelines;Familiarity with DevOps tools such as Git, Terraform, Git;Strong hands-on exposure with ETL Extract, Transform, Load tools;Possess strong written and verbal communication abilities, effectively conveying information to various stakeholders.",
        "desirable_skill_list": "Experience in designing, building, and maintaining batch and real-time data pipelines;Experience with Databricks or Snowflake.",
        "responsibility_list": "Work closely with the various team in architecting, designing and building ingestion pipelines to collect, clean, merge, and harmonize data from different source systems;Involved in architecting and scaling data analytics infrastructure on cloud environment; development of systems, architectures, and platforms that can scale large volume and variety;Architect and build ingestion pipelines to collect, clean, merge, and harmonize data from different source systems;Improve and optimize the workloads, processes to ensure that performance levels can support continuous accurate, reliable, and timely delivery of data products; ensure maximum database uptime;Monitoring of databases and ETL systems for database capacity planning and maintenance, monitoring, and performance tuning; diagnose issues and deploy measures to prevent recurrence;Construct, test, and update useful and reusable data models based on business data needs;Engagement and collaboration with product managers, software engineers, data analysts and data scientists to build scalable and data-driven platforms and tools;Collaborate with data stewards to establish and enforce data governance policies, best practices and procedures;Assist to maintain master data catalogue to document data assets, metadata and lineage;Implement and enforce data security best practices, including access control, encryption, and data masking, to safeguard sensitive data;Involved in managing production services that provide analytics capabilities to our various data users across the division."
    },
    {
        "title": "Network Engineer",
        "description": "Our client is seeking a Network Engineer(s) to enhance and maintain the network performance service level to ensure the smooth business operations within the organization. You will be responsible to handle the incident response & investigation, working with vendors and the respective teams to efficiently resolve issues within the agreed Service Level Agreement (SLA).",
        "company": "Ho Bee Investment",
        "monthly_pay": 9500,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Internship",
        "mandatory_skill_list": "Diploma or Degree in Computer Science, Engineering, Electronics or Information Technology;At least 5 years of working experience in managing IT system network operations and support (24×7), service recovery, problem management, risk mitigation and impact assessment;Proven track record with over 5 years of hands-on experience in successfully implementing IT infrastructure projects for LAN and WAN environments;Proficient in installing and configuring a wide range of network technologies, including LAN, WAN, VoIP, WiFi, wireless controllers, access points, firewalls, security gateways, VPNs, 802.1x protocol, VLANs, and L2/3 switches;Skilled in using monitoring, network diagnostic, and network analytics tools to ensure optimal network performance and troubleshoot issues efficiently;Excellent communication and interpersonal skills, with the ability to explain technical concepts to non-technical users;Strong problem-solving skills and the ability to work independently and collaboratively in a team environment.",
        "desirable_skill_list": "Professional and technical certifications that include CCIE, CCNA, CCDP, CCNP, ITIL, CISSP, AWS Certified Solutions Architect.",
        "responsibility_list": "Lead and manage the 24/7 network operations, incident handling, maintenance, compliance, and renewal of IT infrastructure systems (Wired/Wireless) to ensure all systems are working in good condition to maintain normal operations;Ensure proper project and change management to ensure delivered solutions meet technical, functional, performance and business requirements;Responsible to detect signs of abnormality and to report overall system health status to ensure recovery actions, correction actions and preventive measures are in place for every incident reported;Be the point of contract to attend to any incident/problem reported and to provide the impact assessments on the outage;Work closely with vendors on mitigation measures and assist to resolve the issues and investigation for root cause;Maximizing network performance through ongoing monitoring and troubleshooting;Ensuring peak network performance through continuous monitoring and effective troubleshooting;Scheduling and coordinating network upgrades while investigating network faults;Ensuring network equipment is up-to-date with the latest firmware releases;Perform system maintenance and deliver regular network status reports to key stakeholders."
    },
    {
        "title": "QA Tester",
        "description": "Join our dynamic team that values your insights, offers growth opportunities, and celebrates innovation. As a QA Tester, you’ll play a crucial role in shaping the future of our products.",
        "company": "GuocoLand",
        "monthly_pay": 11000,
        "address": "7 Wallich St",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree / Diploma holder from recognized university, preferably in Business or Computer Science;At least 2-3 years of experience in the field of software Quality Assurance;Prior work experience in banking domain;Strong understanding the life cycle of UAT/ manual testing;Proficient with Microsoft Office applications;Familiar with Software Testing Development and Testing methodology, especially Agile;Possess accuracy and attention to details with strong analytical, creative problem-solving skills to troubleshoot and resolve UAT issues effectively.Possess strong verbal and written communication skills;Ability to work both independently and within a team with good inter-personal skills.",
        "desirable_skill_list": "Knowledge in fraud risk management / credit cards / unsecured loans application processes.",
        "responsibility_list": "Assist the team with upgrade activities, ensuring seamless integration and minimal disruption to operations;Collect system requirements and document changes in workflow;Execute User Acceptance Testing (UAT) and perform regression testing;Engage in the go-live process and verify post-implementation activities.Ensure accurate data flow between systems;Perform UAT and regression testing per the approved test plan;Escalate critical issues promptly with documented evidence;Monitor post-go-live performance to ensure effectiveness;Engage in project activities and meetings related to credit fraud management and instinct;Ensure timely deliverables meet quality standards and project governance;Provide regular updates and reports on project progress."
    },
    {
        "title": "Technical Lead (Front-End)",
        "description": "We are looking for passionate and experienced Technical Lead in C# .NET Development to contribute to enterprise software development, working on challenging projects that require your expertise in Microsoft technologies.",
        "company": "Far East Orchard",
        "monthly_pay": 10000,
        "address": "1 Farrer Sq",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Engineering and / or Computer Science;At least 5 years plus of professional experience in C# .NET Development;Proficient in using presentation frameworks such as WPF and ASP. Net;Strong understanding of relational database concepts and hands-on experience with SQL, particularly MS SQL;Skilled in using Git with a solid grasp of Git workflows;Experience working in Agile Scrum teams and familiarity with productivity tools like Jira and Confluence;Team player with excellent interpersonal and communication skills, capable of both independent work and effective collaboration;Good communication and presentation skills are required.",
        "desirable_skill_list": "Experience working with DevOps tools such Jenkins and Kubernetes;Certified .NET Developer.",
        "responsibility_list": "Involved in Software Development, maintenance and support of custom-built software application;Prepare comprehensive technical documentation using Jira and Confluence to ensure clear communication;Lead and coach software engineers in a supportive and transparent team environment;Gather requirements from the business users and translate them into technical specifications;Responsible for developing technical specifications, coding, implementation, integration, documentation and user guide;Work closely with co-developers, testers and business users to develop and improve operations processes and procedures;Conduct unit testing on software deliverables and provide the relevant assistance during product test, integration test and user acceptance test;Participate in evaluation technical risks and perform impact analysis to ensure effort estimate is accurate;Maintain all technical standards and ensure adherence at all times for best practices, frameworks, software coding standards / guidelines;Involved in application support and provide effective solutions for UAT and SIT;Work with regional teams (remote/onsite), vendors and end-users to implement solutions;Provide recommendations to achieve better system performance and efficiency."
    },
    {
        "title": "Test Lead",
        "description": "We are seeking a proactive Test Lead to ensure the quality and performance of our software products. This role involves spearheading comprehensive testing strategies, both manual and automated, while collaborating closely with cross-functional teams to deliver exceptional software solutions.",
        "company": "Hiap Hoe",
        "monthly_pay": 8500,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree in Computer Science or Engineering or Information Systems;Proven experience of at least 5-7 years in software testing, with a strong emphasis on test management and leadership roles;Strong understanding in Testing processes, guidelines, frameworks, checklist, policies and Test case management as well as quality assurance principles;Hands-on experience in testing activities, such as integration, regression, performance, and sanity testing, to ensure that software components align with defined requirements and functional specifications;Good experience in business application testing and exposure in cross-system testing (integration testing);Proficiency in developing and executing detailed test scenarios and test cases;Experience with defect (bug) tracking systems and managing documentation of testing results and issues;Experience in automation testing using Tosca, Selenium, Cucumber, Karate, Postman, Jmeter or other open source automation tools;Strong leadership and mentoring skills to guide junior testers and promote best practices;Detail-oriented mindset with a keen ability to identify defects and inconsistencies;Excellent communication and interpersonal skills for effective collaboration with diverse teams.",
        "desirable_skill_list": "Certification in software testing (e.g., ISTQB, CSTE, CSQA);TOSCA certified",
        "responsibility_list": "Lead the development and review of comprehensive test scenarios and test cases, ensuring adherence to specifications and quality standards;Oversee a variety of testing types to verify that software components meet specified requirements;Document test results meticulously in a bug tracking system like JIRA, prioritize issues, and ensure timely resolution;Collaborate with developers to identify, troubleshoot, and resolve issues effectively;Audit and enforce testing milestones and standards throughout the Software Development Life Cycle (SDLC);Provide ongoing support during System Integration Testing (SIT) and User Acceptance Testing (UAT), delivering progress reports to stakeholders;Foster daily interactions with business, technical, and project teams to ensure clear communication regarding project requirements;Maintain a comprehensive understanding of our products, features, and customer usage to inform testing strategies;Be flexible in taking on additional testing responsibility_list as needed to contribute to the overall success of the project."
    },
    {
        "title": "Project Manager",
        "description": "Exciting opportunity for experienced professional to join our team as Project Manager;",
        "company": "Chip Eng Seng",
        "monthly_pay": 9500,
        "address": "100 Cecil St",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's degree required, preferably in Computer Science or Information Systems;Professional qualification in project management is required (e.g., PMP, Prince2) and Agile methodologies (e.g., Agile SAFe, Scrum Master, or Kanban);Minimum of 8 years of hands-on project management experience;At least 3 years of experience working with Agile methodologies;Demonstrated experience working with both regional and global teams;Proven ability to manage complex projects and handle multiple projects simultaneously;Extensive project management skills, including planning, budgeting, tracking, status reporting, and stakeholder management;Strong understanding of various technology platforms, including Desktop, Systems, Servers, Data Centers, and Storage;Strong presentation skills with the ability to effectively communicate ideas and project updates;Proven track record of successfully managing troubled teams or projects and driving them to successful outcomes;Exceptional leadership, communication, and vendor management skills;Effective supervisory capabilities, with a proven ability to lead project teams comprised of members from various departments andProficient in stakeholder management, with a focus on maintaining positive relationships and effective communication.",
        "desirable_skill_list": "Experience in the Banking or Insurance industry is preferred;Experience working within a Centre of Excellence model is advantageous andDemonstrated experience in managing large-scale office integration and relocation projects is preferred.",
        "responsibility_list": "Evaluate, respond to, and manage project implementation using agile practices;Oversee project budget and cost management in accordance with internal business rules;Monitor and control project execution through Plan, Build, and Run processes;Prepare and deliver project performance and status reports; ensure completion documentation is shared and discussed;Conduct project evaluations and present findings to Service Owners and Group Infra Lead;Liaise with global and regional stakeholders, including Business, IT, and Operations, to ensure effective communication and collaboration.Identify potential project risks and develop appropriate mitigation strategies;Collaborate with senior management on communications, project updates, and escalation processes. Lead and deliver the TIM Project on schedule while achieving business objectives;Oversee and coordinate various workstreams and platforms to ensure timely project delivery;Collaborate with senior management to align project direction and scope with strategic business needs. Influence peers, stakeholders, and leaders to support informed decision-making;Proactively identify and assess risks and issues, develop mitigation plans, and provide timely updates to management;Facilitate regular meetings with stakeholders, including management, peers, and vendors, to ensure effective communication and alignment;Guide the technical team to deliver the business value outlined in the project plan, working closely with stakeholders and the project sponsor andPlan and manage the project effectively, including resource scheduling, management, and change control, in adherence to company policies and guidelines."
    },
    {
        "title": "Business Analyst",
        "description": "We are seeking a highly motivated and skilled Business Analyst with experience in Fund Services (Fund Administration/ Transfer Agency) for an eminent bank.",
        "company": "Koyo Holdings",
        "monthly_pay": 10500,
        "address": "38 Beach Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Business Administration, Information Technology, or a related field;Gather and evaluate business requirements to develop detailed User Stories that accurately reflect user needs and expectations;Experience in Fund Transfer, Fund Administration, or Transfer Agency, within Hedge Fund Sector;Collaborate with stakeholders to ensure alignment;Design and prepare User Acceptance Testing (UAT) test cases;Execute these tests to validate functionality against requirements and track the progress of testing activities;Manage defects by documenting, categorizing, and reporting them to relevant teams;Assist in identifying and resolving production issues swiftly, collaborating with technical teams to ensure minimal disruption to operations;Track and compile statistics related to ongoing Management Information Systems (MIS);Analyze this data for metrics and benchmarks reporting, providing insights for strategy presentations and decision-making.",
        "desirable_skill_list": "Familiarity with Transfer Agency operations and understanding hedge fund performance fee calculations.",
        "responsibility_list": "Gather, assess, and document business requirements to create detailed User Stories;Act as the primary liaison for users throughout the Software Development Life Cycle (SDLC);Advocate for user interests in discussions with stakeholders to prioritize their needs;Design and prepare UAT test cases to validate system functionality against requirements;Execute testing activities, track progress, and manage defect documentation and reporting;Support and coordinate system change implementations among various teams;Monitor and assess the outcomes of changes after deployment to ensure stability;Collaborate with technical teams to identify and resolve production issues efficiently;Collect and compile statistics related to ongoing Management Information Systems (MIS);Maintain strong communication with stakeholders to gather feedback and ensure ongoing alignment with business objectives;Identify opportunities for process improvements and participate in initiatives to enhance efficiency and effectiveness."
    },
    {
        "title": "C# .NET Developer",
        "description": "We are seeking a passionate and experienced C# .NET Developer who excels in dynamic environments and is driven to make a significant impact.",
        "company": "United Engineers",
        "monthly_pay": 11500,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Engineering, and/or Computer Science;Minimum 3+ years of professional experience in C# .NET Development;Proficiency in WPF and ASP.NET for presentation frameworks;Strong understanding of relational database concepts; hands-on experience with MS SQL;Proficient in Git with solid grasp of Git workflows;Experience in Agile Scrum teams; familiarity with Jira and Confluence;Good communication and presentation skills;",
        "desirable_skill_list": "Experience working with DevOps tools such Jenkins and Kubernetes;Certified .NET Developer;",
        "responsibility_list": "Being involved in software development, maintenance, and support of custom-built software applications;Prepare detailed technical documentation using Jira and Confluence to ensure effective communication;Conduct unit testing on software deliverables and assist in product, integration, and user acceptance testing;Provide post-implementation support, investigating and troubleshooting issues to ensure uninterrupted operation;Any other ad-hoc responsibility_list assigned."
    },
    {
        "title": "Database Administrator",
        "description": "We are looking for a highly skilled and experienced Database Administrator to work on projects within Technology and Operations team in a renowned bank.",
        "company": "Lum Chang Holdings",
        "monthly_pay": 10000,
        "address": "10 Anson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Computer Science, Information Technology, or a related field;Minimum 3 years of experience with proficiency in at least 1 Database such as Mysql/MariaDB, PostgreSQL/EDB, Oracle, MSSQL,DB2, MongoDB and Redis;Ability to work in a 24/7 rotational shift environment, including nights, weekends, and holidays;Strong analytical and troubleshooting skills with the ability to address complex database issues under pressure;Perform database patching and upgrades both manually and using automation tools like Robosys to ensure systems are up-to-date and secure;Utilize basic knowledge of Linux (RedHat), AIX, and Windows operating systems, including basic commands, to manage and troubleshoot database environment;Manage and resolve database incidents, working with the Major Incident Management (MIM) team to address and coordinate high-priority issues;Excellent verbal and written communication skills to effectively collaborate with team members and document procedures.",
        "desirable_skill_list": "Relevant certifications (e.g., Microsoft Certified Database Administrator, Oracle Certified Professional) are a plus;Experience with cloud-based database services (e.g., AWS RDS, Azure SQL Database).",
        "responsibility_list": "Install, configure and maintain database systems (e.g., SQL Server, Oracle, MySQL) ensuring high availability and performance;Continuously monitor database performance and health; identify and resolve performance bottlenecks and optimize queries and database structures;Provide 24/7 support for database-related issues; perform troubleshooting and issue resolution to minimize downtime and service interruptions;Maintain comprehensive documentation for database configurations, procedures, and policies;Work closely with development teams, system administrators, and other stakeholders to support application deployments and database-related tasks;Apply patches and updates to database systems as required to address vulnerabilities and improve functionality;Apply Linux (RedHat), AIX, and Windows operating systems, including basic command-line operations;Stay informed on banking industry regulations, standards, and best practices related to database management, security, and compliance."
    },
    {
        "title": "Software Engineer – ETL",
        "description": "Identify gaps in ETL job pipeline. Perform data normalization to smoothen data processing pipeline, wide exposure to various databases technology and automation, Manage Extract, Transform and Load process on data pipelines. Develop ETL job pipeline using ETL tools and Maintain ETL job scheduling and housekeeping for optimal load.",
        "company": "Yongnam Holdings",
        "monthly_pay": 9000,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "5+ years’ working experience in ETL;Preferably with 2 years’ work experience in insurance industry;Required hands-on experience on IBM DataStage or relevant ETL softwares;Strong communication skills, including prioritizing, problem solving and interpersonal relationship building;Proven time management cum organization skills (must be able to prioritize workload and meet deadlines).",
        "desirable_skill_list": "Familiar with ETL/ELT framework, data warehousing concepts, data management framework and data lifecycle processes;Experienced in handling and processing different types of data (structured, semi-structured and unstructured);Strong knowledge in various database technologies (RDBMS, NoSQL and columnar);Strong understanding of programming languages like Python;Experienced working in insurance industry will be an added advantage;Ability to communicate and present technical information in a clear and unambiguous manner.",
        "responsibility_list": "Design, develop, document and implement end-to-end data pipelines and data integration processes, both batch and real-time;This include data analysis, data profiling, data cleansing, data lineage, data mapping, data transformation, developing ETL / ELT jobs and workflows, and deployment of data solutions;Monitor, recommend, develop and implement ways to improve data quality including reliability, efficiency and cleanliness, and to optimize and fine-tune ETL / ELT processes;Recommend, execute and deliver best practices in data management and data lifecycle processes, including modular development of ETL / ELT processes, coding and configuration standards, error handling and notification standards, auditing standards, and data archival standards."
    },
    {
        "title": "Data Analyst",
        "description": "We are looking for a Data Analyst to support the CBGWM Data Governance Team in areas such as Metadata Management and Data Quality Management in a renowned Bank.",
        "company": "Tat Hong Holdings",
        "monthly_pay": 10500,
        "address": "25 Ubi Ave 1",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Bachelor’s Degree or Diploma in Business Studies, Business Analytics, Information Technology, Computing, or related fields;Experience in the financial services or management consulting industry, with a solid understanding of financial operations;Proficiency in SQL;Experience with any data technologies and programming languages such as Hadoop, Cloudera Data Platform, Google Cloud/AWS, Python, PySpark, Superset;Strong verbal and written communication skills;Team player and works independently.",
        "desirable_skill_list": "Experience with data technology (Teradata) is preferred;Experience with Data Management frameworks like DAMA or DCAM is advantage.",
        "responsibility_list": "Assess and approve metadata submissions, ensuring they align with quality standards and provide feedback;Lead training sessions and disseminate knowledge regarding best practices in metadata management;Assist with both routine and ad-hoc Data Quality assessments to ensure data accuracy;Take on additional responsibility_list as assigned by your supervisor;Work closely with cross-functional teams to understand their data needs and provide analytical support;Utilize various data analysis tools and programming languages (e.g., SQL, Python, R) to conduct analyses;Suggest enhancements to existing data processes and workflows."
    },
    {
        "title": "Senior Business Analyst- Operational Excellence",
        "description": "We are seeking an experienced Senior Business Process Transformation Manager to be involved in a large scale (fast pace) operational transformation project and to support the operational and strategic initiatives through meticulous process engineering and business analysis.",
        "company": "Hong Fok",
        "monthly_pay": 9500,
        "address": "1 Raffles Quay",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Banking, Business, Finance or Economics, Information Technology,At least 10 years of working experience in project management or PMO management experience in the banking industry;Must have 5+ years of Project Governance and Quality Assurance;Good experience in innovative or economically driven environment, working on Business Process Management/ Business Process Re-engineering projects;Experience in creating and maintaining project and programme plans, including risks, actions, issues, dependencies;Exceptional stakeholder management skills and ability to manage project team members across multiple business units;Proven success of working effectively in a cross-functional team in an international environment;Good understanding or analytical skills in uncovering new opportunities for collaboration;Excellent communication skills, emotional intelligence, and ability to influence key decisions, mediate conflicts, and build consensus both internally and externally;Strong skills in communication, consulting, negotiation, and conceptualization.",
        "desirable_skill_list": "Work experience in consulting firm for banking clients.",
        "responsibility_list": "Be a part of the wholesale banking team in the capacity of a business analyst / project manager;Engage with various stakeholders and business project teams in initiatives focused on Operational transformation;Run Business Process Re-engineering workshops (interviews) with stakeholders to elicit and validate the business requirements;To quickly respond to issues raised, through good understanding of business, operational and technical considerations, and recommend sound solutions;Articulate business case scenarios and contribute towards the development and scoping of the Project;Coordinate with surround Project team members to achieve project objectives;Ensure that all Project work is carried out as per the defined standards and procedures;Implement project governance standards including tracking, monitoring and updating the status of programme or project deliverables;Create all Project related documentation and participate in project related walkthroughs;Prepare all Project related reports and highlight risk and issues impacting the project to the Management."
    },
    {
        "title": "AWS SysOps Administrator",
        "description": "As an AWS SysOps Administrator, you will be responsible for managing and operating cloud-based systems, ensuring optimal performance, availability, and security. You will work closely with development and IT teams to deploy and maintain scalable cloud solutions while implementing best practices in system administration and automation.",
        "company": "CDL",
        "monthly_pay": 11000,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "",
        "desirable_skill_list": "",
        "responsibility_list": ""
    },
    {
        "title": "Business Delivery Manager",
        "description": "We're seeking a dynamic leader to support our Credit Card team in executing impactful campaigns that drive payment volume.",
        "company": "CapitaLand",
        "monthly_pay": 10000,
        "address": "8 Marina View",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Finance, Information Technology, banking and related discipline;Has 2 years of work experience in stakeholder management and end to end project Management in banking industryExperience in conducting User Acceptance Test (UAT) and live verification (LV);Manage multiple stakeholders, multi-task and work under pressure in a fast-paced and dynamic environment;Has strong project management and organizational skills with great attention to detail;Good Understanding of Stakeholder management and requirements gathering;Excellent communication skills and can work independently;Strong team player with good interpersonal skills.",
        "desirable_skill_list": "Knowledge of Credit Cards and loyalty rewards systems (One Loyalty System) will be an added advantage;Prior experience working with rewards system will be an added advantage.",
        "responsibility_list": "Support end-to-end campaign setup in the One Loyalty System (OLS) to assist the team in executing campaigns;Gather user requirements from business users regarding campaign requests;Coordinate the prioritization of campaign requests;Plan and execute User Acceptance Testing (UAT) and live verifications (LV) by drafting test scenarios, setting up data, and validating results with business users to ensure desired outcomes;Collaborate with the Rewards Delivery Team and the external vendor (OneEmpower) to prepare the Paraforms and establish campaign rules in OLS;Manage the resolution of UAT and production issues for the campaigns in collaboration with business and delivery teams."
    },
    {
        "title": "System Analyst",
        "description": "We're on the hunt for an experienced System Analyst to take charge of the end-to-end deployment and delivery of IT infrastructure for exciting projects. If you’re ready to make an impact and drive innovation, we’d love to hear from you!",
        "company": "City Developments",
        "monthly_pay": 9000,
        "address": "120 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology and related discipline;At least 10+ years of working experience, preferably in banking environments;Expertise in Apache, JBOSS, IBM WebSphere, IBM IHS, IIS Administration;Candidate with operational experience, preferably in support of critical application systems will have an advantage;The candidate has strong infrastructure/technical background with knowledge on Open Systems platform, Firewall and load balancer, and moderate information security knowledge;Good leadership skills in working with application teams and service providers in defining infrastructure deployment plan, cutover/migration strategy and test plan;Have a good understanding of ITIL processes;Candidate speaks and write well.",
        "desirable_skill_list": "Good to have experience working with Banking/Financial Sector.",
        "responsibility_list": "Manage end-to-end deployment and delivery of IT infrastructure for projects, including planning, setup, testing, pre-production readiness, and production cutover and ensure smooth transition to Operations before project closure;Collaborate with Solution Engineers, Application teams, Infrastructure SMEs, and service providers to meet project objectives and schedules and review solution scope, implementation, and cutover strategies;Prepare and submit change requests for infrastructure deployment (e.g., facility/VM, IP/DNS/Hostname, SAN requisitions) in compliance with bank policies and approved designs;Manage risks and escalations during project deployment to achieve target SLAs for Infrastructure Provisioning;Ensure disaster recovery readiness per Bank Policy;Interface with Infrastructure, Project Management, and Application Development teams for setup readiness;Track and report on Vulnerability Threat Management (VTM) schedules and remediation efforts;Support installation, configuration, and maintenance of Middleware components (e.g., JBOSS, APACHE, WebSphere) and manage firewall changes, DNS, and SLB configuration requests;Provide 24/7 support for UAT and Production systems;Address pen test vulnerability fixes and manage patch deployment for all platforms and support EOS/EOL upgrades."
    },
    {
        "title": "Front Office Specialist – Derivatives",
        "description": "We are looking for a specialist consultant  having knowledge of  financial markets, risk management concepts to provide effective support to the front office team. This will be an opportunity  to be part of global team within Financial Markets.",
        "company": "Keppel REIT",
        "monthly_pay": 11500,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's degree  in Computer Science, Mathematics, Financial Engineering, Quantitative Finance or a related discipline;Proven experience with front office trading products – Derivatives / Credit Derivatives / Interest Rates Derivatives;Experience in providing functional support to front office traders and risk management teams;Hands on experience in IT Operations / Support including Functional support to end users;Has analytical skills to identify root causes in workflows incidents which could be data, technical or functional issues;Technical skills: Linux, python, scripting, SQL/Oracle, automated workflow orchestration tooling, affinity with modern distributed middleware;A good team player, cross functional, enjoys interacting with people of all levels in a multicultural environment;Excellent stakeholders management skills;Proactive, good communication skills and attentive to details.",
        "desirable_skill_list": "Experience of supporting on real-position management system;Familiarity with Datasynapse, Apache Ignite (GridGain), Google Cloud Platform, Docker and orchestration for it like Kubernetes or Openshift.",
        "responsibility_list": "Manage and oversee production incidents arise during trading activities, lead incident resolution efforts, coordinating with relevant teams and stakeholders to minimize disruptions;Involved in providing functional support for the derivatives platform, ensuring smooth operation of real-time and intraday position management system during ASIA trading hours;Drive effective problem management, ensure preventive and detective measures of the applications are identified and resolved through the backlog and communication/ dialogue with the Product Owner;Implement and work with the latest tooling with a strong focus on performance, stability and security;Find opportunities to automate the testing of existing features, performance, and security as well as the automation of deployments, monitoring, and more;Perform Functional testing and Change Management activities to ensure the safe deliveries to Production environment;Conduct user training sessions and create documentation to help user on system functionalities and reporting tools;Work Closely with colleagues from other areas of expertise and take initiative in expanding knowledge (both within and outside of your area of expertise) that is relevant for the area in which you work."
    },
    {
        "title": "Senior Analyst – SAP FICO",
        "description": "We are seeking a dynamic Senior Analyst (SAP FICO) who will be responsible for supporting the organization's SAP ERP system, specifically the FICO modules, through close collaboration with business users to deliver solutions and provide operation support.",
        "company": "Mapletree Logistics Trust",
        "monthly_pay": 10500,
        "address": "8 Marina Blvd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Engineering;At least 5 years of experience working with SAP, with a minimum of 3 years of experience in SAP FICO feasibility studies and implementations;Proficiency in SAP implementation methodologies and hands-on experience with S/4HANA, particularly in FICOExperience and knowledge of working with SAP FICO including General Ledger Accounting, Accounts Receivable, Accounts Payable, Bank Accounting, Asset Accounting, Fund Management, Cost Centre Accounting, Profit Centre Accounting, Workflow and User Exit;Good experience with integration with external systems;Strong understanding of accounting and finance processes, particularly in power plants or manufacturing environments;Proven track record of delivering projects on time and within budget, managing scope, risks, and stakeholder communications effectively;Strong in verbal and written communications, analytical and problem solving skills with strong attention to details;Good Vendor management, stakeholder communications and management.",
        "desirable_skill_list": "Familiarity with the latest SAP technologies, such as SAP BTP and Fiori apps.Experience with SAP MM and PS modules.",
        "responsibility_list": "As an SAP FICO Subject-Matter-Expert (SME) to oversee the functional design review process to provide guidance and recommendations for the S4Hana migration project;Conduct thorough business analysis to identify opportunities for process improvement and define business requirements for SAP implementations;Collaborate with stakeholders to map business processes, requirements, and use case;Develop the business case, including budget, timeline, resources, vendors, and solutions;Perform gap analysis to align business requirements with system functionalities;Maintain comprehensive business requirement documents and assist vendors in developing functional specifications;Oversee the execution of test plans to ensure implementations meet quality standards and business needs;Facilitate user acceptance testing, ensuring timely resolution of any issues;Liaise with the technical team to ensure functional requirements are effectively translated into system design;Ensure clear alignment between project scope and business objectives, managing any changes effectively."
    },
    {
        "title": "Endpoint Security Engineer",
        "description": "To fortify the organization's digital environment against cyber threats such as ransomware, malicious code, and data loss;This role is essential in maintaining the security and integrity of our IT systems, requiring a proactive and knowledgeable individual who can navigate complex security challenges and drive continuous improvement in our security posture.",
        "company": "Ascendas Real Estate Investment Trust",
        "monthly_pay": 9500,
        "address": "80 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Minimum 3 years working experience in Endpoint security team leading role, preferably in Financial Services;Regional experience with in-depth knowledge in IT Security Technical or Engineering especially AV, EDR, Configuration Baseline Solution and cloud security;Experience in working with technical and business users in a diverse environment.",
        "desirable_skill_list": "Certifications or Official training on End Point Protection Technology. Product Knowledge from these solution providers would be an advantage;McAfee ENS or Malwarebytes or Defender for Endpoint (AV);CrowdStrike or Carbon Black or SentinelOne or Tanium (EDR);Qualys or Tenable (Vulnerability and Configuration);Mail Security (Email);Candidates should have hands on experience implementing Baseline Configuration Standards (e.g. CIS) for Technology such as Windows/Linux Operating System or Networking (e.g. Cisco IOS);Excellent interpersonal and influential skills to enable the implementation and enforcement of the IT Security Engineering program;Good communication and presentation skills;Strong analytical skills with ability to evaluate and diagnose complex issues and situations;Strong coordination and facilitation skills across multiple working groups.",
        "responsibility_list": "Install and manage desktop and server protection tools for real-time threat auditing, reporting, and removal;Consult with IT engineers on security architecture, design reviews, and security solution upgrades;Engineer, deploy and test security solutions/agents for Windows/Linux platforms;Collaborate with Workstation Engineers to document endpoint images, detailing the functionality of security agents and their provided functions;Analyse security incidents, recommend process and technology improvements, and respond efficiently to threats, intrusions, malware, unauthorized access, insider attacks, and data loss;Basic understanding of programming/scripting (VBS/PowerShell/Python);Engage with end-users, teams, management, and software vendors for security initiatives;Mentor junior group members in security tool usage through informal training and documentation."
    },
    {
        "title": "Manager, IT Service Delivery",
        "description": "The IT Service Delivery Manager will coordinate cross-functional teams, implement IT service management (ITSM) frameworks, and ensure compliance with service level agreements (SLAs). The ideal candidate will possess strong leadership skills, technical expertise, and a commitment to continuous improvement.",
        "company": "Suntec REIT",
        "monthly_pay": 11000,
        "address": "3 Temasek Blvd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Minimum 8 years’ experience in IT Service Management, preferably in Finance institution / enterprise, Shared Services or consulting firms;Degree from Information Technology or equivalent discipline;ITIL v3 practitioner qualifications preferred;PMP certification is an added advantage;Demonstrated effective communication in a multinational corporation with great personality and people skill;Excellent skills in both written and spoken English and Cantonese.",
        "desirable_skill_list": "Good knowledge of overall IT infrastructure domains;Experience in managing service delivery operations with internal teams and third-party services;To have a systematic, disciplined and analytical approach to problem solving with good attention to detail;Experience in establishing, monitoring and ensuring adherence to policies and procedures;Insurance Business general knowledge is preferred.",
        "responsibility_list": "To be an ambassador for Infrastructure services, working across the organization to provide effective communication on matters raised and build relationships with other teams to establish effective dialogue between departments;Compliance of Corporate Policy;Steer the adoption of ITSM processes in the country and regionally;Ensure quality services are being delivered according to the SLA agreed with the respective country or business unit;Coordinate with internal support and external service providers, business users, project managers and other relevant stakeholders to ensure effective communication on matters relating to the services in scope;Ensure appropriate and up to date controls, ITSM processes, documentation and procedures are in place and followed;Coordinate with service delivery teams to provide regular and accurate management reporting on service performance against SLA’s and KPI’s;Drive internal and third-party service review meetings covering performance, service improvements, quality and processes."
    },
    {
        "title": "Project Manager",
        "description": "We are looking for a Project Manager experienced in content repositories, website or intranet platforms. It is an opportunity to take up the role of site owner and closely collaborate with content publishers across various departments in a renowned bank.",
        "company": "Frasers Centrepoint Trust",
        "monthly_pay": 10000,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in business, Communications, Information Systems, or a related field (or equivalent experience;Proven experience in managing large-scale projects involving multiple stakeholders;Familiarity with content governance practices and regulatory compliance;Experience working with cross-functional teams, including IT and Compliance;Previous experience managing large-scale intranet content repositories;Basic knowledge of IT infrastructure, including backup and recovery processes;Proven experience in content management, web development, or related fields;;Strong understanding of user management, permissions, and role-based access control;Ability to interpret user feedback and data to drive improvements in the content hub;Proficient in troubleshooting technical issues and providing efficient user support;",
        "desirable_skill_list": "Experience with Generative AI integration is a plus;Experience in the financial or banking industry is a plus.",
        "responsibility_list": "Work closely with stakeholders from Technology, Front Office, Product Teams, CIO, Business Management/Marketing, and COO to align business requirements with the creation and governance of the content hub;Ensure adherence to the bank’s design and branding guidelines in all aspects of the content hub;Redesign the Knowledge Hub site map and the landing page to enhance intuitiveness and engagement, incorporating banners and shortcuts to frequently used resource;Create and populate content across various pages, including setting expiry dates and manage user accounts, assign roles, and set permissions to maintain security for different teams and user groups;Oversee the creation, updating, and organization of content to ensure relevance and compliance with internal guidelines;Conduct regular audits to ensure adherence to content maintenance policies.;Continuously improve the functionality of the content hub based on user feedback, focusing on usability, streamlined navigation, and optimized page layouts;Develop training and communication materials for Content Publishers and end-users;Collaborate with stakeholders to develop end-to-end workflows and process maps for SOPs across various teams;Facilitate the integration of the content repository with the Enterprise Knowledge Base, including testing, tagging content with keywords, and troubleshooting issues."
    },
    {
        "title": "Oracle Service Logistics Lead",
        "description": "We are seeking a highly experienced Oracle Service Logistics Lead for an exciting program in the APAC region. The ideal candidate will have a proven track record in implementing Oracle Service Logistics and related Oracle ERP modules, particularly in the Manufacturing industry.",
        "company": "OUE Commercial REIT",
        "monthly_pay": 9000,
        "address": "50 Collyer Quay",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "10+ years of experience in Oracle ERP implementations;At least 2 full lifecycle implementations in Oracle Service Logistics, Oracle Maintenance Cloud, and Oracle Order Management / Manufacturing;Strong expertise in Oracle ERP solutions, particularly within the Manufacturing industry;In-depth understanding of Oracle ERP architecture and business processes;Proven ability to lead projects, manage stakeholders, and ensure timely delivery of Oracle solutions;Organized, disciplined and ability to manage multi-locations interactions;Strong communication and collaboration skills, with the ability to interact effectively with cross-functional teams.",
        "desirable_skill_list": "Oracle certifications in relevant modules;Experience in leading Oracle ERP projects in the APAC region.",
        "responsibility_list": "Lead Oracle Service Logistics, Oracle Maintenance Cloud, and Oracle Order Management/Manufacturing implementations;Collaborate with stakeholders to define and implement Oracle solutions;Manage full lifecycle ERP projects, including scoping, configuration, testing, and go-live;Ensure integration with existing systems and adherence to best practices;Advise manufacturing clients on Oracle Service Logistics and related processes;Oversee project teams, timelines, and deliverables;Act as the subject matter expert for Oracle ERP in manufacturing."
    },
    {
        "title": "Business Analyst",
        "description": "Seeking Experienced Business Analyst: Strong grasp of methodologies, exceptional analytical skills, and effective communication with diverse stakeholders.",
        "company": "First REIT",
        "monthly_pay": 12000,
        "address": "1 Raffles Quay",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technolgy / Finance/ Business or its equivalent professional certificates;At least 3 years of working experience as a Business Analyst in a project setting within Insurance/ Financial Services Industry;Proven experience in General Insurance sectors including travel, motor, property, health, and accidents;Expertise in gathering and documenting business requirements, developing functional specifications, and writing user stories;Strong analytical and problem-solving capabilities, with a strategic and critical approach to addressing challenges;Excellent interpersonal and communication skills, adept at conveying complex concepts to both technical and non-technical stakeholders;Meticulous attention to detail with a demonstrated ability to manage multiple priorities and meet deadlines effectively;Ability to work both independently and collaboratively within a dynamic, fast-paced environment.",
        "desirable_skill_list": "Familiarity with software development lifecycles and agile methodologies;PMP / Scrum certified.",
        "responsibility_list": "Engage with stakeholders to gain a thorough understanding of business objectives, requirements, and challenges;Elicit and document user requirements, translating them into detailed functional specifications and user stories;Conduct gap analysis to identify discrepancies between current processes and desired outcomes, proposing actionable solutions to address these gaps;Develop and maintain comprehensive business process models, use cases, and other relevant documentation to support system development and process improvements;Perform feasibility studies and cost-benefit analyses to assess potential solutions, providing recommendations to stakeholders based on findings;Work closely with technical teams to ensure the accurate translation of business requirements into technical specifications;Facilitate user acceptance testing (UAT) and provide support to end-users during the implementation and post-implementation phases;Partner with stakeholders to drive continuous improvement in business processes, systems, and workflows."
    },
    {
        "title": "System Analyst (Pega)",
        "description": "Looking for an System Analyst with Pega cum Java development experience to develop, implement and maintain their large-scale application systems.",
        "company": "Cache Logistics Trust",
        "monthly_pay": 11000,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science or Information Technology;Has at least 5 years of experience in Java/J2EE development and application support;Has at least 3 years of experience in analysis, design, development and implementation of related activities on PEGA systems;Has technical experience in Pega PRPC and Pega frameworks;Good knowledge on PRPC Architecture, design and implementation features;Involved in projects involving usage of Pega frameworks and BPM/BRE solutions;Experience in one or more of the following:\n\nPega Customer Relationship Management (CRM);\nPega Frameworks;\nPegaRULES Process Commander (PRPC);Pega Customer Relationship Management (CRM);Pega Frameworks;PegaRULES Process Commander (PRPC);Strong in verbal and written communications, analytical and problem solving skills with strong attention to details.",
        "desirable_skill_list": "PEGA SA/SSA/ CLSA certifications.",
        "responsibility_list": "Responsible for design and implementation of Pega systems;Gathering and analyzing of business requirements;Involve in the requirement analysis phase to ensure feasibility of functional specifications;Actively contribute to architectural decision and ensure delivered software meets business requirements;Perform code reviews and hands-on coding to ensure best practices are followed;Provide timely resolution of incidents and mitigation of potential risks;Coordinate communications activities and provide timely project progress updates to stakeholders."
    },
    {
        "title": "SAP Technical Specialist",
        "description": "Looking out for an SAP Technical Consultant who will be responsible for supporting the organization's SAP ERP system, specifically the FICO modules, through close collaboration with business users to deliver solutions and provide support.",
        "company": "Manulife",
        "monthly_pay": 10000,
        "address": "80 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Engineering;At least 6 years of experience working with SAP, with a minimum of 4 years of experience in SAP FICO configuration;Participated in at least two full life-cycle SAP ERP implementations (either S/4 HANA or ECC) and at least one roll-out/support project;Experience and knowledge of working with SAP FICO including General Ledger Accounting, Accounts Receivable, Accounts Payable, Bank Accounting, Asset Accounting, Fund Management, Cost Centre Accounting, Profit Centre Accounting, Workflow and User Exit;Experience in Dialog Programming, ABAP/4 Dictionary, SAP Queries (SQ), Interactive ALV, Logical database, Report formatting and events, Dialog, SAP data migration tools (e.g., BDC, LSMW), BADI, Customer and User exit and forms, SAP Scripts, and Smart Forms;Experience with reports programming, interface development, performance tuning, modification and support of SAP customized and standard programming;Good experience in ABAP Object Oriented Programming (OOP) Model;Experience working with SAP HANA Studio, Fiori, SAPUI5, JavaScript & JQuery Framework, OData Development, and third-party downstream system integrations (Inbound and Outbound);Good experience with integration with external systems;Strong in verbal and written communications, analytical and problem solving skills with strong attention to details;Good Vendor management, stakeholder communications and management.",
        "desirable_skill_list": "Knowledge on ABAP, 3rd party interface EDI and BAPI;Good understanding of SAP business processes in Finance, Materials Management, Sales and Distribution, Project System, or HCM.",
        "responsibility_list": "Part of the team to provide daily operational support for SAP FICO including analysis and requirements detailing;Oversee the functional design review process to provide guidance and recommendations for best practices;Develop custom SAP reports, interfaces, enhancements, and forms to address complex business problems based on functional requirements and conforming to technical specifications provided;Deliver solution enhancements and consulting services for enterprise systems, systems integration, and solution introduction;Clarify and translate customer requirements and inform business liaison regarding deliverables for assigned requests;Prepare configuration rationale documentation, functional specifications, and creation of test scripts for UAT for every change request or enhancement;Participate in unit testing, integration testing, regression testing, and user acceptance tests;Analyze and execute SAP FICO changes as part of projects for new entity setup and system rollout;Analyze and scope end-user authorization roles;Document details of requests according to IT governance frameworks and capture or update relevant knowledge for transitioning product to support."
    },
    {
        "title": "System Engineer",
        "description": "Our client is seeking a System Engineer to provide subject matter expertise around technical infrastructure for the various domains in Application Infrastructure Operation Systems, Middleware, Database, Storage/Back-up, Virtualization and Cloud technologies.",
        "company": "AIA",
        "monthly_pay": 10000,
        "address": "1 Raffles Quay",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Science, Electronics Engineering;At least 6 years of experience in IT server support and infrastructure maintenance;Working experience in managing or maintaining in one of the following: Microsoft Windows, Oracle Solaris,  Unix, Redhat. Linux Server;Experience in supporting virtualised environment such as VMware or Hyper-V, with Internet and Intranet Web Applications;Experience in supporting WebSphere Application Server, IBM HTTP Server, JBoss Application Server (WildFly);Possess a strong understanding of security practices in server, database, and network;Familiar with system migration, performance-tuning, deployment and troubleshooting IT operational and post project migration issues;Strong communication skills with the ability to communicate across all levels within the organization;Self-motivated, independent, meticulous and at the same time, a good team player.",
        "desirable_skill_list": "Technical certifications in one of the following:\n\nMicrosoft Server Administration;\nOracle Solaris Server Administration;\nCISCO Network Administration;\nFirewall Administration.Microsoft Server Administration;Oracle Solaris Server Administration;CISCO Network Administration;Firewall Administration.",
        "responsibility_list": "Part of the infrastructure support team to upkeep, strengthen and support the infrastructure platformResponsible to manage infrastructure servers, database servers, mainframe servers hosted in the Data Center;Review, support, and endorse infrastructure architecture, infrastructure resource planning, infrastructure performance and system hosting environment focusing on Hardware Infrastructure, Operating Systems, Virtualization, Storage and Backup in support of new application systems;To review any system changes, proactively identifying potential risks and provide mitigations;To monitor the system operations and batch processing ensuring smooth running in all processes;To perform system upgrades and to response to emergency situations;Provide technical solutions on management of infrastructure to meet requirements for audits & compliances;Highlight potential risks, gaps, technical challenges to the team and provide mitigations/alternatives;Ensure processes and controls are in place to ensure the effective management of operations and services beyond the Service Level Agreements (SLA);Handle and manage incident response & investigation, working with vendors and the respective teams to efficiently resolve issues within the agreed Service Level Agreement (SLA)."
    },
    {
        "title": "Java DevOps Developer",
        "description": "",
        "company": "Great Eastern",
        "monthly_pay": 9000,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Computer Engineering, Information Technology & Engineering;Minimum of 5 years of hands-on experience in software development using Java technologies;Experience in system design (include database design), development, quality assurance and maintenance of web based Java enterprise systems;Working experience in Object Oriented Analysis and Design;Proficiency in Java Enterprise Edition or Spring Boot and Microservices;Proficiency in Development of Web-based applications using UI framework such as Angular/AngularJS, JQuery, Struts;Proficiency in Development of application using Persistence framework such as Hibernate, JPA;Proficiency in Relational Databases like DB2, SQL Server, Oracle.;Working experience in using Webserver like Apache Webserver, Microsoft IIS;Hands-on experience with CI/CD tools such as Jenkins, GitLab CI, or AWS DevOps;Working experience in Apache JMeter;Strong scripting skills in languages such as Python;Excellent verbal and written communication skills;Team player with excellent interpersonal and communication skills, capable of both independent work and effective collaboration.",
        "desirable_skill_list": "Working experience in COBOL, CICS, DB2;Familiar in containerization technologies such as Docker and Kubernetes.",
        "responsibility_list": "Part of the software engineering team – involve in requirements analysis, contribute to system design and oversee the development, testing, and deployment of applications;Address performance and security requirements in applications, resolving any related issues;Collaborate effectively with other engineers to integrate software components, system infrastructure, and third-party components;Design and develop APIs within a microservices-based architecture;Work closely with business users and application testers to identify and rectify defects;Monitor application performance, troubleshoot issues, and ensure seamless operation;Involve in Regression Testing and User Acceptance Testing;Troubleshoot deployment issues, conduct root cause analysis, and implement corrective measures to optimize deployment workflows."
    },
    {
        "title": "Automation Tester",
        "description": "An exciting opportunity for a Automation Tester to play a crucial role in ensuring the delivery of high-quality digital transformation projects.",
        "company": "Prudential",
        "monthly_pay": 11000,
        "address": "80 Raffles Place",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree or Diploma in Software Engineering, Computer Engineering or Electrical Engineering;At least 2 years of working experiences in Automation Testing in the banking domain.;Strong proficiency in Appium, Selenium, and JUnit;Extensive coding skills in Java, Objective-C, JavaScript, or related languages;Good experience in crafting complex SQL queries;Competence with basic UNIX commands and ability to navigate Linux environments;Proficient in GIT commands and their applications;Experience with one or more of the following: Cucumber, Appium, Selenium, XCode UI Automation, Espresso;Experience in using tools like SOAP UI and REST API;Strong attention to quality output during the software development and user acceptance stages.",
        "desirable_skill_list": "Familiarity with SOAP UI and web service testing is an advantage;Working knowledge of Bitbucket (experience with other tools is a plus).",
        "responsibility_list": "Design, develop, execute, and maintain test scenarios and comprehensive end-to-end test cases for assigned projects related to user acceptance testing on digital platforms;Write test cases in JBehave for agile projects;Proficient in utilizing testing tools like JIRA and Confluence to execute and track project progress;Identify, report, and monitor defects in application tools while collaborating with stakeholders to ensure issues are resolved;Review BDD/User stories from the Product Owner, and create high-level test scenarios to meet user requirements;Conduct manual or automated testing, log defects, and follow up for timely resolution; generate reports, prepare training materials for touchpoints, and provide updates as needed;Expected to possess expertise in the banking domain, able to create test plans and testing summaries, and execute end-to-end test scenarios via manual or automated testing;Actively contribute to project meetings and discussions, ensuring close attention to detail and effective time management for on-time, high-quality project deliverables;Proactively engage with all stakeholders to complete tasks from clarification through to issue resolution;Skilled in documentation to ensure timely updates for any changes in the project."
    },
    {
        "title": "Senior Manager, Technology Assurance",
        "description": "We are seeking a highly skilled professional to lead the overall definition and execution of our Technology Assurance framework and programs. This role will guide, monitor, evaluate, and report on the efficiency of internal controls related to technology, ensuring compliance with regulatory requirements and industry standards. Define and execute the Technology Assurance framework, ensuring alignment with organizational goals and regulatory standards. Serve as the subject matter expert on compliance requirements related to technology, providing expertise on control/process documentation, testing, and issue management. Lead collaboration efforts with the Group InfoSec Governance team to assess critical gaps against standards and regulatory requirements, both internationally and locally. Conduct expert-level evaluations of technology controls throughout the business cycle, advising on the design and effectiveness of key controls.",
        "company": "NTUC Income",
        "monthly_pay": 9500,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Minimum 6-8 years of experience in IT Audit and Risk Assessment;Degree from Information Technology or equivalent discipline;One of industry recognized certification such as CGEIT, CISSP, CISM, CISA, ISO 27001, CRISC, PCI DSS etc;Excellent stakeholder management and communication skills;Project delivering experience;Solid understanding of current and emerging technologies;Understanding of IT SOX and other IT/IS frameworks and best practices such as COSO, COBIT, ITIL, ISO 27001, SOC 2, 3, etc.",
        "desirable_skill_list": "Good knowledge of privacy regulations and data protection;Detailed oriented and able to work under pressure and accustomed to work under tight deadlines;Team-oriented, collaborative, diplomatic and flexible;Strong written and verbal communication skills, strong interpersonal skills and the ability to communicate effectively across business units.",
        "responsibility_list": "Contribute and support the Head of Technology Assurance & Information Security Governance in defining, developing and maintaining technology assurance framework in accordance with the Group Technology Roadmap;Work closely with senior management of business units and within Group Technology through tracking and reporting function, to ensure regular updates to management on the Technology Assurance programs;Be accountable for the planning, management and execution of the day-to-day activities of Technology related audit engagements;Ensure system and control owners are identified; and coordinate with owners to support technology assurance and assessment activities;Collaborate with key technology, business, risk, audit and compliance teams to identify, evaluate and address critical technology related risks;Proactively research industry trends and define, influence and implement appropriate and practical technology related KRIs, metrics and solutions to create and enhance process efficiency and address key risks;Advise BUs on Technology risk assessment;Working on a group level work with all stakeholder to gather and organise and deliver key business requirements;Ensure the accuracy and consistency of the technology assurance program;Ensure Technology controls are compliant against required standards/ benchmarks and best practices;Ensure timely implementation of recommendations for remediating the weaknesses/deficiencies."
    },
    {
        "title": "Application Developer",
        "description": "We are looking for a Application Developer to support the Team for development and implementation.",
        "company": "AXA",
        "monthly_pay": 10500,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Diploma or Degree in Information Technology or a related field;Proficiency in languages such as Python, JavaScript, UNIX scripting, and SQL;In-depth knowledge of web technologies such as HTML, CSS, React, and similar frameworks;Familiarity with development practices in both Unix and Windows operating systems;Basic understanding of networking fundamentals, including TCP/IP and SNMP protocols;Excellent verbal and written communication abilities, along with strong interpersonal skills to collaborate with diverse teams.",
        "desirable_skill_list": "Knowledge with coding and network management and Nagios, ELK Stack, or Netbrain;Knowledge of LAN/WAN products, particularly from Cisco and Arista.",
        "responsibility_list": "Assist the network team in implementing automation projects for network provisioning and monitoring;Create and maintain dashboards to enhance monitoring capabilities;Manage and ensure the functionality of network monitoring systems and tools;Develop, test, and troubleshoot programs using appropriate hardware, databases, and programming languages;Work with system APIs for integration purposes and presentation;Revise existing programs by updating flow charts and developing detailed logic.Analyze program performance and make improvements in coordination with users and supervisors;Collaborate with users for necessary modifications;Address inquiries regarding program objectives, data input/output requirements, and internal checks;Develop and maintain detailed documentation for all programs and systems;Ensure the protection of all processed, stored, or accessed information;Document programming issues and their resolutions for future reference;Provide technical assistance to other departments as required;Offer direct assistance to users and be available for 24/7 on-call support."
    },
    {
        "title": "Cloud Engineer",
        "description": "We are seeking a talented Cloud Engineer to join our growing team, where you will play a pivotal role in designing, implementing, and managing cloud-based solutions. You will work with DevOps, SRE, and DevSecOps teams across the globe, contributing to the continuous improvement and innovation of Public Cloud domain.",
        "company": "Allianz",
        "monthly_pay": 11500,
        "address": "8 Marina View",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have 4 years of experience in DevOps practices, automation, and CI/CD pipelines;Strong understanding of basic public cloud concepts and services;Proficient in Terraform for automating cloud infrastructure;Strong foundation in networking and cloud networking concepts;Basic understanding of cloud security and governance;Strong analytical and troubleshooting skills;Ability to work effectively in cross-cultural, global teams;Excellent written and verbal communication skills for working with global teams and stakeholders;Ability to work independently in a fast-paced environment, delivering high-quality solutions under pressure.",
        "desirable_skill_list": "Familiarity with implementing security policies in cloud environments;Strong drive to research and experiment with new technologies.",
        "responsibility_list": "Implement new features for applications and platforms, ensuring alignment with business requirements;Design and build CI/CD pipelines for smooth deployment of applications and platforms;Create and propose technical solutions that meet business objectives and requirements;Investigate, assess, and recommend technologies for implementation through Proof-of-Concepts (PoCs);Manage, maintain, update, and secure applications and platforms owned by the squad;Participate in on-call rotation to provide technical support for platforms and applications;Analyze and troubleshoot incidents, resolving issues efficiently;Work closely with Chapter Lead and Cloud Engineers to prioritize backlog and deliverables;Assist in documenting technical solutions and contribute to team standards and best practices;Contribute to the definition of technical standards, guiding the team toward innovative solutions;Investigate and prototype emerging technologies, recommending their adoption into operational environments."
    },
    {
        "title": "KYC Analyst",
        "description": "An exciting opportunity as a KYC Analyst to support the Private Banking KYC team in the financial domain.",
        "company": "Swiss Life",
        "monthly_pay": 10000,
        "address": "100 Cecil St",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma/Degree in Finance, Business or any related field;Has 2-3 years of relevant experience in the compliance/KYC;Has strong knowledge of basic AML/CFT/Sanctions-related information and reasonable understanding of the KYC requirements in Asia (minimally MAS Notice 626);Interest in conducting compliance monitoring / oversight / assessment based on AML/CFT framework and regulations;Excellent verbal and written communication skills;Familiar with Microsoft Office applications including MS Excel, MS Word.",
        "desirable_skill_list": "Professional certifications such as ACAMS or ICA;Familiarity with internal & external screening tools: Actimize / EWSS (ODA) / Dow Jones Risk & Compliance.",
        "responsibility_list": "Provide quality review for periodic ongoing reviews (OGRs) in accordance with established AML policies and PB Middle Office procedures;Complete assigned OGRs within established timelines;Perform independent assessment of OGRs previously closed with conditions and decide whether to conclude with the unwinding of conditions or escalate with a well-thought-out action plan or closure strategy;Provide prompt, concise guidance to stakeholders and handle escalations expeditiously;Proactively identify areas of improvement and suggest viable solutions;Participate in AML-related projects as a content provider or stakeholder;Perform management reporting on key operational risk items;Ensure no repeat review findings by Business Compliance, Group Compliance, Internal, or External Auditors."
    },
    {
        "title": "Senior Analyst – SAP FICO",
        "description": "We are seeking a dynamic Senior Analyst (SAP FICO) who will be responsible for supporting the organization's SAP ERP system, specifically the FICO modules, through close collaboration with business users to deliver solutions and provide operation support.",
        "company": "Generali",
        "monthly_pay": 9000,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Engineering;At least 5 years of experience working with SAP, with a minimum of 3 years of experience in SAP FICO feasibility studies and implementations;Proficiency in SAP implementation methodologies and hands-on experience with S/4HANA, particularly in FICO. Familiarity with SAP MM and PS modules is a plus;Experience and knowledge of working with SAP FICO including General Ledger Accounting, Accounts Receivable, Accounts Payable, Bank Accounting, Asset Accounting, Fund Management, Cost Centre Accounting, Profit Centre Accounting, Workflow and User Exit;Good experience with integration with external systems;Strong understanding of accounting and finance processes, particularly in power plants or manufacturing environments;Proven track record of delivering projects on time and within budget, managing scope, risks, and stakeholder communications effectively;Strong in verbal and written communications, analytical and problem solving skills with strong attention to details;Good Vendor management, stakeholder communications and management.",
        "desirable_skill_list": "Familiarity with the latest SAP technologies, such as SAP BTP and Fiori apps.Practical experience managing procurement, inventory, and logistics in manufacturing or power generation.",
        "responsibility_list": "As an SAP FICO Subject-Matter-Expert (SME) to oversee the functional design review process to provide guidance and recommendations for the S4Hana migration project;Conduct thorough business analysis to identify opportunities for process improvement and define business requirements for SAP implementations;Collaborate with stakeholders to map business processes, requirements, and use casee;Develop the business case, including budget, timeline, resources, vendors, and solutions;Perform gap analysis to align business requirements with system functionalities;Maintain comprehensive business requirement documents and assist vendors in developing functional specifications;Oversee the execution of test plans to ensure implementations meet quality standards and business needs;Facilitate user acceptance testing, ensuring timely resolution of any issues;Liaise with the technical team to ensure functional requirements are effectively translated into system design;Ensure clear alignment between project scope and business objectives, managing any changes effectively."
    },
    {
        "title": "Data Analyst",
        "description": "We are looking for a Data Analyst to support the design, development and implementation of various dashboard requirements in a renowned Bank.",
        "company": "MSIG",
        "monthly_pay": 11000,
        "address": "10 Anson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree holder with a minimum 3 years of experience in delivering end-to-end data and/or digital transformation solutions;Experience with QlikView and Qlik Sense, including dashboard development, data modelling, and reporting;Translating business requirements to technical terms like Data Mapping;Proficiency in Business Intelligence (BI) tools, visualization tools, and scripting;Knowledge of SQL for data manipulation;Good experience working with business users;Excellent problem-solving, strategic thinking, written, presentation, and communication skills;A good team player, with the ability to function independently.",
        "desirable_skill_list": "Work experience in banking industry.",
        "responsibility_list": "Collaborate with a team of data analysts and business users throughout each project stage to ensure timely and high-quality delivery of dashboard solutions;Involve in requirements gathering  and analyze requirements from business stakeholders;Clean, transform, and analyze data to ensure its suitability for dashboard development;Perform data discovery and analysis from the bank’s data platform to assess the feasibility of requirements;Develop visually appealing and intuitive dashboards in QlikView/Qlik Sense to effectively communicate key insights and metrics;Apply best practices in user interface (UI) and user experience (UX) design.Conduct testing and troubleshooting to ensure dashboard functionality and performance across different devices and platforms;Conduct training sessions and roadshows to promote awareness and usage among target users."
    },
    {
        "title": "Product Owner",
        "description": "Are you passionate about driving innovation, creating cutting-edge solutions, and influencing the future of banking technology? We are hiring a Product Owner, in this role you will play a crucial part in delivering world-class digital products that elevate customer experience and business efficiency.",
        "company": "Chubb",
        "monthly_pay": 10500,
        "address": "80 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "At least 2 years of experience in a Product Owner or similar role, ideally in financial services or banking;Strong experience with UAT management and test strategy development;Proven track record of delivering products in an Agile/Scrum environment;Experience providing UAT sign-off against agreed exit criteria and tracking open items during UAT;Ability to create comprehensive release plans with detailed UAT and test strategy components;Strong experience with tools such as Jira, Confluence, and test management tools;Excellent communication and collaboration skills, with the ability to work across teams and manage multiple stakeholders;Strong analytical skills and ability to make data-driven decisions;Attention to detail, with a focus on delivering high-quality solutions on time;",
        "desirable_skill_list": "Certifications like Certified Scrum Product Owner (CSPO) or PMI-ACP;Familiarity with UX/UI best practices and how they impact product development;",
        "responsibility_list": "Define and communicate the product vision and strategy to internal stakeholders, ensuring alignment with overall business goals and objectives;Maintain and prioritize the product backlog, ensuring user stories and requirements are well-documented and aligned with the development team's sprint goals;Lead the User Acceptance Testing (UAT) phase, ensuring that UAT signoff is obtained against the agreed exit criteria;Collaborate with QA teams to define UAT plans and ensure they align with business requirements;Track and manage open items during UAT and ensure timely resolution before release;Develop and manage a comprehensive test strategy in coordination with QA teams;Ensure that all functional and non-functional testing is completed, and any issues are tracked and addressed;Serve as the main point of contact for stakeholders, ensuring that their feedback is incorporated and that they are regularly updated on product progress;Participate in Agile ceremonies such as daily stand-ups, sprint planning, and retrospectives;Work closely with the Scrum Master to create a release plan that includes detailed information on UAT timelines, test strategies, and deployment steps;Define product success metrics (KPIs) and track the performance of new features post-launch;"
    },
    {
        "title": "Application Support Analyst – eFX",
        "description": "Our client is looking for an Application Specialist who has strong domain knowledge in eFX to enhance and support the trading applications",
        "company": "AIG",
        "monthly_pay": 9500,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Part Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Engineering, Computer Science or Information System;Sound knowledge of Financial Markets products;At least 3-5 years of experience in FX trading systems;At least 3-5 years of experience in providing L2 / L3 support;Experience in trading analytics application will be an added advantage;Possess experience in UNIX Shell / Perl Scripting, RDMS, and SQL;Good analytical and problem solving skills;Effective communicator, with the ability to communicate with business users;Independent, proactive and demonstrate 'can-do' mentality;Ability to work under pressure and deliver excellent results;Ability to manage time and tasks efficiently.",
        "desirable_skill_list": "ITIL Certified;Knowledge / experience with KDB+ time series database and analytics.",
        "responsibility_list": "Responsible for providing L2 / L3 support for eFX and related trading applications;Fix bugs, troubleshoot and analyze on the root cause analysis;Collaborate closely with other internal technical / business teams to implement permanent solution;Follow escalation procedures during outages;Write SQL scripts and suggest automation to improve efficiency / effectiveness of support team;Adhere to change management requirements for application and system implementations."
    },
    {
        "title": "Application Support Manager",
        "description": "We are seeking a driven Application Support Manager who is competent in project management related to Traffic Engineering and Management and committed to deliver exceptional service.",
        "company": "Liberty Insurance",
        "monthly_pay": 11000,
        "address": "120 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma or Degree in Electrical Engineering, Computer Engineering/Science or Information Technology;Has at least 5 years of relevant experience in Application Support and Operations;Must have handled activities like incident management, problem management, release management, root cause analysis, deployment and monitoring;Understand Software Development Life Cycle SDLC, experience working with business users, various IT teams and vendors in managing the project cost and project risk;Experience in IT end-to-end procurement process (i.e. budget approval, tender/quotation, purchase requisition, invoice tracking and verification);Excellent team player with the ability to communicate across all levels within the organization;Positive attitude and able to work under pressure;Excellent technical troubleshooting skills;Strong interpersonal and communication skills.",
        "desirable_skill_list": "PMP and ITIL certifications.",
        "responsibility_list": "Responsible to provide application support in all stages of the Information Technology (IT) application life cycle related to Traffic Engineering and Management projects within the organization;Responsible to handle change requests, service request and incident tickets; ensuring proper ownership and closure of these request/tickets;Responsible to create and secure appropriate approvals for planned and adhoc system changes;Involve in user and system support during and post system implementation;Support IT audit activities when required;Manage the vendors service quality, contract and support standard in accordance to corporate policies and guidelines;Perform escalation procedures to senior levels, annual capacity planning and ensure high availability of system up-time;Collaborate with architect, application delivery teams to drive ITIL best practises through automation and Agile methodology;Ensure compliance to the corporate standards, policies and guidelines related to the application services;Maintain hardware and software assets, annual asset stock take; and to inform management on need for technology refresh before assets are end-of-life;Manage, support and track IT changes activities; provide monthly IT application and operations statistics."
    },
    {
        "title": "Data Scientist",
        "description": "We are seeking an experienced Data Scientist to join a leading global banking institution. In this role, you will leverage your expertise in data analytics, machine learning, and AI to drive innovative, data-driven solutions that address complex business challenges. You will work with vast amounts of data to extract insights, build predictive models, and contribute to the strategic decision-making process.",
        "company": "MetLife",
        "monthly_pay": 10000,
        "address": "8 Marina View",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Have 4 years of hands-on experience in data science and machine learning;Bachelor or higher degree in Mathematics, Computer Science, Statistics, or a related field;Proficiency in NLP, Neural Networks & Object Detection: Hands-on experience in Natural Language Processing (NLP), Convolutional Neural Networks (CNN), LSTM, and Document Processing Automation;Proven track record in using classical and advanced machine learning techniques such as supervised/unsupervised learning, clustering, classification, regression, and decision trees;Proficiency in Python and data science libraries like Scikit-learn, Pandas, Matplotlib, etc;Proficiency in Data Analytics (data collection, cleaning, wrangling, and exploratory data analysis);Strong knowledge of SQL and experience with analytical tooling;Experience with Google Cloud Platform (GCP), VertexAI, or Azure for machine learning operations (MLOps);Strong problem-solving skills and a data-driven approach to decision-making.",
        "desirable_skill_list": "Comfortable working in global, remote teams and coordinating efforts across different time zones;Ability to translate complex data-driven insights into business language and present findings effectively to non-technical stakeholders.",
        "responsibility_list": "Utilize data analytics, machine learning models, and data visualization techniques to generate insights that solve complex business problems;Build machine learning models for tasks like NLP, Object Detection, Optical Character Recognition (OCR), and Document Classification to drive automation and operational improvements;Collaborate with product owners, senior management, and other stakeholders to deliver data-driven recommendations and clear visualizations that inform business strategies;Stay current with the latest advancements in machine learning and AI to develop innovative solutions tailored to the organization’s needs;Ensure all data usage complies with internal and external regulatory policies, maintaining data privacy and security;Effectively manage timelines and deliverables, ensuring key business expectations are met."
    },
    {
        "title": "UI/UX Designer",
        "description": "We are looking for a highly skilled and experienced UI/UX Designer to work as a product designer within Institutional Banking team.",
        "company": "Etiqa",
        "monthly_pay": 9000,
        "address": "100 Cecil St",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s degree in Design, Human-Computer Interaction, or a related field;3+ years of experience in UI/UX design, preferably in a digital product environment;Strong portfolio showcasing your design process and examples of work that demonstrate your ability to create engaging user experiences;Proficiency in design tools such as Sketch, Figma, Adobe XD, or similar;Strong understanding of user-centered design principles and methodologies and work closely with stakeholders and fellow designers;Experienced in collaborating with research teams to translate user insights into impactful designs that align with business goals;Proficient in creating user journey maps, wireframes, and prototypes, with a keen eye for detail and a commitment to producing high-quality work;Thrive in dynamic environments, staying up-to-date with industry trends and actively contributing to the UX community;Excellent communication skills, articulate ideas effectively to stakeholders, ensuring that my designs are built to meet real-world needs.",
        "desirable_skill_list": "Strong understanding of user-centered design principles and methodologies;Familiarity with front-end development (HTML, CSS, JavaScript) is a plus.",
        "responsibility_list": "Conduct user research and usability testing to gather insights and inform design decisions;Analyze user behavior to identify pain points and opportunities for improvement;Create wireframes, prototypes, and high-fidelity mockups that reflect user needs and business objectives;Ensure designs are visually appealing and align with our brand identity;Work closely with cross-functional teams including product managers, developers, and other designers to iterate on designs based on feedback and technical feasibility;Plan and conduct user testing sessions, gather feedback, and iterate on designs to enhance usability and accessibility;Keep up-to-date with industry trends, tools, and best practices in UI/UX design to continuously improve design processes and outcomes;Create and maintain design specifications, style guides, and design systems to ensure consistency across all platforms;Effective stakeholder management."
    },
    {
        "title": "System Engineer",
        "description": "We are seeking a skilled and highly motivated System Engineer who has strong Windows Server Management experience to help manage the installation, configuration, testing and support in IT system implementation projects.",
        "company": "Tokio Marine",
        "monthly_pay": 12000,
        "address": "1 Raffles Place",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma or Degree in Computer Science, Information Technology, or Engineering;At least 2 years of experience as a System Engineer or similar role, with a focus Windows 10 and 11 operating system;Strong knowledge of desktop hardware components, peripherals, and their configuration;Experience as a System administrator, provide support, troubleshoot and maintain computer servers and networks;Good technical skill in LAN/WAN, configuration and troubleshooting server, storage and tape library hardware knowledge;Proficiency in diagnosing and resolving technical issues related to window server computing;Familiarity with software deployment tools and methodologies;Experience with Active Directory, Group Policy, and system security configurations;Excellent communication and interpersonal skills, with the ability to explain technical concepts to non-technical users;Possesses strong problem-solving and analytical skills with ability to work independently and collaboratively in a team environment;Able to work within tight timelines with good prioritization skills.",
        "desirable_skill_list": "Knowledge in networking technologies encompassing Fortinet, Sophos and Cisco switch, router, and firewalls.",
        "responsibility_list": "Install, configure, and maintain Windows 10 and 11 operating systems in the IT system implementation projects;Manage IT operations including managing servers, active directory, backups, virtualization, storage and other infrastructure related tools;Diagnose, troubleshoot, and resolve hardware and software issues related to servers;Collaborate with cross-functional teams to deploy software applications, updates, and patches across the server environment;Implement and manage security measures, including antivirus software, firewalls, and encryption, to safeguard against potential threats and vulnerabilities;Monitor and optimize system performance, ensuring efficient utilization of the servers and responsiveness of user applications;Provide technical support and guidance to end users, addressing inquiries, resolving problems, and offering training as needed;Performing on-site for system troubleshooting to support users facing issues on both Windows and Linux systems;Create and maintain documentation related to system configurations, processes, and troubleshooting procedures;Understanding the customers system architecture and design to better support future enhancement in server system usage;Deploy endpoint protection and ensure firewalls are configured properly on both Windows and Linux systems;Manage and follow up with IT vendors on IT service level delivery and server issue;Collaborate with various IT vendors on project implementation."
    },
    {
        "title": "Manager – Retention Transformation Office",
        "description": "We are seeking a Manager – Retention Transformation Office to lead and execute transformation projects aimed at optimizing business processes and enhancing operational efficiency. This role involves project management, process improvement, and collaboration with cross-functional teams to implement strategic initiatives and drive retention.",
        "company": "China Taiping",
        "monthly_pay": 11000,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Education: Bachelor’s degree in Business Management or a related field.Experience: 2 years in insurance project management or business transformation roles.Languages: Proficiency in English and Hindi is required.Proficiency in MS Office (Word, Excel, PowerPoint)Strong communication skills and knowledge of retention scriptsTechnical knowledge for tools developmentAbility to coordinate effectively with different teamsProblem-solving skills and proactive learning attitude",
        "desirable_skill_list": "Familiarity with insurance project management or business transformation rolesAbility to adapt to new technologies, processes, and changing prioritiesStrong analytical skills for business process evaluation",
        "responsibility_list": "Project Management: Manage end-to-end transformation projects, including planning, execution, and progress monitoring.Process Optimization: Identify areas for improvement and implement strategies to enhance business processes.Cross-Functional Collaboration: Work with diverse teams to support the successful implementation of transformation initiatives.Business Analysis: Conduct thorough operational analyses, identify gaps, and propose data-driven solutions.Benchmarking & Data Insights: Perform industry benchmarking, analyze data trends, and use insights for process improvements and retention strategies.Training & Performance Monitoring: Develop training programs for new processes, monitor performance, and generate regular MIS reports."
    },
    {
        "title": "Technical Designer",
        "description": "We are seeking a Technical Designer to collaborate with architects and engineers, using CAD software to create detailed technical plans and ensure compliance with regulations.",
        "company": "Fubon Insurance",
        "monthly_pay": 9500,
        "address": "80 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Diploma/Degree in Electrical & Electronics / Mechanical Engineering / Mechanical Design / Computer Science / Software Engineering;Has 1-2 years of experience in developing and building 3D models using AutoCAD / AutoDesk;Good understanding of scaling and dimensioning;Knowledge of mechanical, electrical and structural design;Familiar with project milestones and schedules;Excellent communication and interpersonal skills;Strong problem-solving skills and the ability to work independently and collaboratively in a team environment.",
        "desirable_skill_list": "Familiarity with construction knowledge.",
        "responsibility_list": "Responsible to develop CAD drawings using Autodesk system to prepare engineering blueprints based on project design specifications;Collaborated with engineers and contractors to ensure seamless integration of engineering designs; collate the structural cabling layer into the overall master blueprints;Ensure compliance with company standard drawing procedures in blueprint review;Attend weekly meeting with related project personnel on design updates;Coordinated with multiple suppliers to ensure timely delivery of construction materials, minimizing project delays and cost overruns;Monitor and support (administrative) the construction progress and address site-related issue."
    },
    {
        "title": "Application Support Analyst – eFX",
        "description": "Our client is looking for an Application Specialist who has strong domain knowledge in eFX to enhance and support the trading applications",
        "company": "Income Insurance",
        "monthly_pay": 10500,
        "address": "1 HarbourFront Ave",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Information Technology, Computer Engineering, Computer Science or Information System;Sound knowledge of Financial Markets products;At least 3-5 years of experience in FX trading systems;At least 3-5 years of experience in providing L2 / L3 support;Experience in trading analytics application will be an added advantage;Possess experience in UNIX Shell / Perl Scripting, RDMS, and SQL;Good analytical and problem solving skills;Effective communicator, with the ability to communicate with business users;Independent, proactive and demonstrate 'can-do' mentality;Ability to work under pressure and deliver excellent results;Ability to manage time and tasks efficiently.",
        "desirable_skill_list": "ITIL Certified;Knowledge / experience with KDB+ time series database and analytics.",
        "responsibility_list": "Responsible for providing L2 / L3 support for eFX and related trading applications;Fix bugs, troubleshoot and analyze on the root cause analysis;Collaborate closely with other internal technical / business teams to implement permanent solution;Follow escalation procedures during outages;Write SQL scripts and suggest automation to improve efficiency / effectiveness of support team;Adhere to change management requirements for application and system implementations."
    },
    {
        "title": "Test Lead",
        "description": "We are seeking a proactive Test Lead to ensure the quality and performance of our software products. This role involves spearheading comprehensive testing strategies, both manual and automated, while collaborating closely with cross-functional teams to deliver exceptional software solutions.",
        "company": "HL Assurance",
        "monthly_pay": 11500,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor's degree in IT, Engineering, or a related discipline, or equivalent practical experience;Proven experience of at least 5-7 years in software testing, with a strong emphasis on test management and leadership roles;Solid understanding of software development methodologies, testing techniques, and quality assurance principles;Proficiency in developing and executing detailed test scenarios and test cases;Experience with bug tracking systems and managing documentation of testing results and issues;Strong leadership and mentoring skills to guide junior testers and promote best practices;Excellent communication and interpersonal skills for effective collaboration with diverse teams;Detail-oriented mindset with a keen ability to identify defects and inconsistencies;Perform a range of testing activities, such as integration, regression, performance, and sanity testing, to ensure that software components align with defined requirements and functional specifications.",
        "desirable_skill_list": "Certification in software testing (e.g., ISTQB, CSTE, CSQA);TOSCA certified",
        "responsibility_list": "Lead the development and review of comprehensive test scenarios and test cases, ensuring adherence to specifications and quality standards;Oversee a variety of testing types to verify that software components meet specified requirements;Document test results meticulously in a bug tracking system like JIRA, prioritize issues, and ensure timely resolution;Collaborate with developers to identify, troubleshoot, and resolve issues effectively;Audit and enforce testing milestones and standards throughout the Software Development Life Cycle (SDLC);Provide ongoing support during System Integration Testing (SIT) and User Acceptance Testing (UAT), delivering progress reports to stakeholders;Foster daily interactions with business, technical, and project teams to ensure clear communication regarding project requirements;Maintain a comprehensive understanding of our products, features, and customer usage to inform testing strategies;Be flexible in taking on additional testing responsibility_list as needed to contribute to the overall success of the project."
    },
    {
        "title": "IT Project Manager",
        "description": "We are seeking a seasoned Project Manager to lead strategic initiatives and foster strong partnerships with business stakeholders. This role is critical in aligning project objectives with business goals, enhancing user experiences, and ensuring the successful delivery of projects within a large-scale organization",
        "company": "Prudential",
        "monthly_pay": 10000,
        "address": "8 Marina View",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "A degree in Computer Science, Information Technology, or a related field;A minimum of 10 years of project management experience, including at least 3 years in program management within a large organization;Experienced to lead and oversee large scale migration / platform upgrade projects within the organization;Experience in contract negotiation and vendor management;Exceptional leadership and project management capabilities;Strong decision-making and problem-solving skills;Detail-oriented with the ability to manage multiple tasks effectively;Excellent verbal and written communication skills, enabling collaboration with stakeholders at all levels.",
        "desirable_skill_list": "PMP or Scrum Certified;Experience in change management .",
        "responsibility_list": "Project Manage, gather and understand the business objectives with multiple business stakeholders on projects;Manage the projects from end-to-end, quality, budgets and teams to completion;Build and lead cross-functional project teams while motivating and coaching team members to ensure project success;Manage stakeholder expectations and ensure their engagement throughout the project;Plan and execute change management strategies for migration projects;Work with technical and functional teams, vendors, business stakeholders and delivery teams;Provide strategic alignment of project goals between teams;Provide proposals for internal teams on functional and technical scope, architecture, system integration, user experience and training;Formulate solution plans on gaps identified for the project;Keep abreast of regulatory/legislation changes that affects the compliance, procedures and processes;Review policies and controls and suggest improvements on frameworks;Facilitate training and communication to help users adapt to new systems or processes."
    },
    {
        "title": "IT Security Engineer",
        "description": "We are hiring for a global banking leader that prioritizes cutting-edge security measures to safeguard financial operations worldwide. This is an exciting opportunity to be part of a dynamic team where security is integral to every aspect of the business. You will be working in a globally recognized institution, contributing to innovative security solutions while ensuring compliance with industry-leading standards.",
        "company": "NTUC Income",
        "monthly_pay": 9000,
        "address": "100 Cecil St",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Has 5+ years of experience in IT Security within a financial or global organization;Bachelor’s Degree in Computer Science, Information Technology, or related fields;Experience with security tools such as Jenkins, GitLabCI, Docker, Ansible, and other similar technologies;Solid understanding of Cloud Security (AWS, GCP), Network Security, and Application Security;Hands-on experience with vulnerability management and penetration testing;Knowledge of IT Governance and regulatory guidelines for information security in global financial services;Experience working with cross-functional teams in a global setting is preferred;",
        "desirable_skill_list": "Certifications like CISSP, SANS GSSP, or CSSLP are a plus;",
        "responsibility_list": "Create and enforce security policies aligned with the global strategy to protect the organization’s applications and infrastructure;Conduct security risk assessments on applications, networks, and systems, ensuring vulnerabilities are identified and mitigated using tools like SAST and DAST;Collaborate closely with DevOps teams to seamlessly integrate security measures within CI/CD pipelines, automating processes where possible;Provide ongoing security training and workshops to improve awareness and ensure compliance with global standards across all departments;Lead efforts in vulnerability management, penetration testing, and responding to security incidents while proposing and implementing remediation actions;Design and implement technical solutions to counter evolving security threats;"
    },
    {
        "title": "System Analyst –  Java",
        "description": "",
        "company": "Great Eastern",
        "monthly_pay": 12000,
        "address": "1 Raffles Place",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor in Computer Science, Computer Engineering, Information Technology & Engineering;Minimum of 5 years of hands-on experience in software development using Java technologies;Experience in system design (include database design), development, quality assurance and maintenance of web based Java enterprise systems;Working experience in Object Oriented Analysis and Design;Proficiency in Java Enterprise Edition or Spring Boot and Microservices;Proficiency in Development of Web-based applications using UI framework such as Angular/AngularJS, JQuery, Struts;Proficiency in Development of application using Persistence framework such as Hibernate, JPA;Proficiency in Relational Databases like DB2, SQL Server, Oracle.;Working experience in using Webserver like Apache Webserver, Microsoft IIS;Strong skills in using code versioning tools, such as GIT;Excellent verbal and written communication skills;Team player with excellent interpersonal and communication skills, capable of both independent work and effective collaboration.",
        "desirable_skill_list": "Working experience in COBOL, CICS, DB2;Experience integration with Adobe Experience Manager (AEM).",
        "responsibility_list": "Part of the software engineering team – involve in requirements analysis, contribute to system design (include database design), and oversee the development, testing, and deployment of applications;Address performance and security requirements in applications, resolving any related issues;Collaborate effectively with other engineers to integrate software components, system infrastructure, and third-party components;Work closely with business users and application testers to identify and rectify defects;Monitor application performance, troubleshoot issues, and ensure seamless operation;Generate comprehensive documentation and relevant artifacts;Offer technical support during the maintenance phase of the system;Design and develop APIs within a microservices-based architecture."
    },
    {
        "title": "Business Data Analyst",
        "description": "We are looking for a Business Data Analyst to support Consumer Banking team on Data and Dashboards related requirements within Banking industry.",
        "company": "AIA",
        "monthly_pay": 11000,
        "address": "10 Anson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Bachelor’s or Master’s degree in Business or Computer Science;At least 2-4 years of experience as a Business, System or Data Analyst within banking industry;Hands-on experience in data querying (SQL);Experience in handling of data schemas and data wrangling;Involved in projects / initiatives, starting from Requirements Gathering, Functional Specs review to User Acceptance Testing and Live Verification;Very good proficiency in SQL queries/scripting and able to extract data from databases;Good Understanding of Stakeholder management and requirements gathering;Strong team player with good interpersonal skills",
        "desirable_skill_list": "Experience in Consumer/Retail Credit domain;Knowledge of consumer credit loan systems and customer systems for cards and unsecured loan products.",
        "responsibility_list": "Be a Part of Risk Management team and work collaboratively in cross-functional teams to become an effective “bridge” between users and technology;Able to prepare proper documentation on the data flow, design, business solutioning and testing approach in accordance with predefined template;Should collate and rationalise all stakeholders’ requirements and walkthrough these requirements with team;Responsible to handle large volume of data for analysis, wrangling, reconciliation and testing;Actively partner the team in the solutioning process to ensure that the business solutions are properly implemented in line with the user needs;Responsible for overall UAT management in terms of timelines, batch runs and managing the testing results;Responsible for understanding the scope of the project, the changes associated and support the Project Manager in impact assessment."
    },
    {
        "title": "Salesforce Technical Consultant",
        "description": "",
        "company": "Manulife",
        "monthly_pay": 10000,
        "address": "80 Robinson Rd",
        "remote": true,
        "job_type": "Full Time",
        "mandatory_skill_list": "Degree in Computer Science, Information Technology, Engineering;Minimum of 5 years of Salesforce development experience, especially with Service Cloud;Good understanding of SFDC fundamental concepts (application, data and security), CRM domain knowledge (Sales Cloud, Service Cloud and Marketing Cloud) and Salesforce Lightning framework;Strong technical foundation in integration components for SFDC, SFDC APIs (SOAP, REST, BULK APIs), Apex controllers, Apex Web Services, Visualforce, Apex callout, inbound & outbound messaging, SFDC data loaders, middleware;Hands-on configuration experience in administration setup, such as managing organisation, users, profiles, roles, security controls, data & support processes configuration;Experience in report & dashboard configuration;Strong analytical and problem solving skills; experience in both process and solution analysis;Strong interpersonal skills, results oriented and ability to work independently and effectively in a global team environment;Ability to multitask effectively and deliver working solutions on a tight schedule and fast-paced environment;Strong oral and written communication skills.",
        "desirable_skill_list": "Salesforce Certification;Service Cloud Consultant certification;Experience with OmniStudio & Omniscript will be a bonus.",
        "responsibility_list": "Responsible for development, testing , implementation and documentation of Salesforce application;Design custom objects, custom fields, picklists, page layout, workflow, approval processes, validation rules & flow;Handle change request and implement enhancements using Salesforce frameworks and Apex;Conduct analysis and configuration of Salesforce, implement, and test the platform-specific solutions, and/or other related packages and add-ons;Develop and maintain integrations between SFDC and 3rd party services (eg. APIs, middleware);Migrating/Deploying codes and SFDC components using out of the box and/or other deployment tools;Document faults, implement resolution & retests, to agreed standards;Able to adapt to the fast-changing environment and ambiguous situation;Identify areas of improvement and develop mitigation plans."
    },
    {
        "title": "Full Stack Developer",
        "description": "We are seeking a Full Stack Developer with strong expertise in Java EE and Spring Boot frameworks, coupled with solid front-end development experience. The ideal candidate is passionate about clean, high-quality code and best practices, and enjoys solving complex problems with a focus on user-centric design.",
        "company": "AXA",
        "monthly_pay": 11500,
        "address": "1 HarbourFront Ave",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "2+ years of experience in backend development with Java, Spring Boot, JPA / Hibernate;Expertise in SOA / Microservices and modern web technologies;Knowledge of front-end frameworks like Vue.js, strong skills in HTML5, CSS3, and JavaScript (including OOP);Experience with Webpack, NPM, and other front-end development tools;Utilize modern authorization mechanisms like JSON Web Token (JWT) for secure data transmission;Ensure code quality by following industry best practices and using tools that support efficient and clean code;Knowledge on cross-browser compatibility to deliver consistent user experiences across different platforms;",
        "desirable_skill_list": "Understanding of Agile development methodologies;Familiarity with web socket and experience in UX/UI design.",
        "responsibility_list": "Responsible for reviewing and enhancing existing application to improve productivity and system performance;Create and manage SQL scripts for database table creation and manipulation as required by the project;Experience in development, maintenance, and support of in-house systems, ensuring quality programming, testing, and documentation;Collaborate with team members and stakeholders, engaging in the Agile Development Life Cycle, participating in Agile ceremonies, and delivering solutions via CI/CD pipelines;Participate in the full software development lifecycle (SDLC), including design, coding, testing, deployment, and support;Additionally, you will handle systems administration, deploy solutions across environments, write test cases and SQL scripts, and provide mentorship to junior developers, while overseeing country-specific team deliveries;"
    },
    {
        "title": "Associate Vice President (AVP) – Web Applications",
        "description": "We are seeking a highly skilled and dynamic Associate Vice President (AVP) for Web Applications, Payment Gateway, and Communications. This role requires a seasoned professional with a strong techno-functional background in the insurance industry. The ideal candidate will have expertise in document management systems, API integration, SQL, system architecture, and chatbot technologies. The role involves leading projects that integrate high-level technology solutions while managing internal and external stakeholders effectively.",
        "company": "Swiss Life",
        "monthly_pay": 10500,
        "address": "120 Robinson Rd",
        "remote": false,
        "job_type": "Full Time",
        "mandatory_skill_list": "Education : Graduate or Post-Graduate in any disciplineWork experience: 5-8 years of experience, with 2-3 years in the insurance industryTechno-functional understanding of the insurance industryExperience with Document Management Systems (any DMS)Experience with event-driven architecture and high-level system design is highly desiredStrong knowledge of API/service layers, REST & SOAPProficiency in SQL (Oracle, MSSQL, PostgreSQL) including triggers, procedures, and best practicesFamiliarity with batch jobs, Java runnable jars, and background in Java/J2EE or .NETUnderstanding of chatbot development and AI/ML use cases in insuranceKnowledge of Apache Kafka implementationExperience with online payment gateways and integrated systemsStakeholder management and project management skills",
        "desirable_skill_list": "Knowledge of SOA (Service-Oriented Architecture) principlesFamiliarity with integrated systems and online payment gateways",
        "responsibility_list": "Lead the development and management of web applications, payment gateway systems, and communication platformsCollaborate with cross-functional teams to design high-level system architectures and event-driven solutionsEnsure efficient use of APIs, service layers, and batch jobs for optimal integration across platformsDevelop and implement document management solutions aligned with business goalsLead the deployment of chatbots and AI/ML initiatives within the insurance domainManage database-related activities, ensuring best practices are followed, including the use of SQL triggers and proceduresOversee the implementation of Kafka and integration with online payment systemsProvide project leadership, managing stakeholders, and ensuring successful project outcomes"
    }
]